{
  "VATexempt": "VAT exempt.",
  "subsidized": "These courses are subsidized in Spain up to 100% by Fundación Tripartita. Other countries may have other conditions, please contact us for details.",
  "subsidizedShort": "Subsidized in Spain by Fundación Tripartita",
  "Price": "Price",
  "Home": "Home",
  "Training": "Training",
  "Contact": "Contact",
  "defaultDesc": "Extrema Sistemas is the lead training company in Spain and Italy, provider of certification courses for the Google Cloud Platform and the Spring technology stack.",
  "indexTrainingTitle": "Enjoy the training lead",
  "indexTrainingDesc": "The best IT training courses at the best price.",
  "html5ShortDesc": "Learn about the latest updates on the HTML5 and CSS3 drafts, and optimize your development workflow for modern and legacy browsers.",
  "springDesc": "The official courses about the portfolio of products that have become a de facto standard for the development of Java applications.",
  "groovyAndGrailsDesc": "Quickly move your teams beyond the basics and on to the most powerful aspects of Groovy and Grails.",
  "googleCloudPlatformDesc": "Google Cloud Platform enables developers to build, test and deploy applications on Google’s highly-scalable and reliable infrastructure.",
  "googleTrainingPartner": "<b>Official Course:</b> includes the official exam to become a Qualified Google Cloud Developer (emitted by Google).",
  "springCertifiedPartner": "<b>Official Course:</b> includes the official exam to become a Certified Spring Developer (emitted by VMware).",
  "readMore": "Read more",
  "getInContact": "Get in contact now",
  "consultingTitle": "Get the natural advantage from consulting",
  "consultingDesc": "Join the list of clients that are relying on our consulting and mentoring services.",
  "Courses": "Courses",
  "html5Desc": "<p>This course introduces the latest updates to HTML5 and CSS3, dedicating special attention to current support in Firefox, Chrome and Internet Explorer.</p><p>During these three days we will review the best practices for web development using the latest standards, reviewing updated techniques and patterns of web design compared with their previous alternatives. This is a very complete course that covers from wireframing and UI patterns to SEO and browser market share, including a detailed description about which versions of IE are still relevant.</p>",
  "showCourseContents": "Show course contents",
  "hideCourseContents": "Hide course contents",
  "availableCourses": "Available courses",
  "askForMoreInfo": "Ask for more info",
  "details": "Details",
  "discountsNotCumulative": "Discounts are not cumulative.",
  "multipleRegistrations": "<b>Multiple registrations:</b> 10% for two registrations and 15% for three or more.",
  "extremaAlumni": "<b>Members of extrema-alumni:</b> 15% discount.",
  "tripartita": "Courses sponsored by Fundación Tripartita.",
  "hibernateWithSpringTitle": "Hibernate with Spring (NEW)",
  "hibernateWithSpringDesc": "<p>In this 3-day training you will learn how to create effective data-driven Spring applications with Hibernate. The training shows the use of both XML and annotation based configuration of both Spring and Hibernate.</p><p>Through our trainings, you benefit from the wide experience and architectural expertise of our team. We bring that experience to you in a highly interactive, intensely hands-on setting.</p>",
  "springCoreTitle": "Spring Core Official Course",
  "springWebTitle": "Spring Web Official Course",
  "grailsDesc": "<p>This four-day intensive training presents Groovy and Grails in detail. After a thorough introduction to the technology, students are taken through many advanced aspects of the Groovy programming language and the Grails Web application framework. This training is designed to quickly move teams beyond the basics and on to the most powerful aspects of Groovy and Grails.</p><p>Students should expect intensive, hands-on interactive lab work.</p>",
  "Discounts": "Discounts",
  "springCoreVoucher": "Attendees will receive a voucher for the certification exam to become a <b>SpringSource Certified Spring Professional</b>.",
  "springWebVoucher": "Completion of this training entitles the student to receive a free voucher to schedule the exam that is required to become a <b>VMware® SpringSource® Certified Spring Web Application Developer</b>. This training is ideal preparation for the certification exam.",
  "eiwsVoucher": "Completion of this training entitles each student to receive a free voucher to schedule an exam to become a <b>SpringSource Certified Enterprise Integration Specialist</b>.",
  "backToCourses": "Back to courses",
  "Duration": "Duration",
  "Language": "Language",
  "Audience": "Audience",
  "Requirements": "Requirements",
  "Objectives": "Objectives",
  "afterCompleting": "After completing this course",
  "Syllabus": "Syllabus",




  "html5Duration": "24 hours",
  "html5Language": "This course can be delivered in English for in-house courses.",
  "html5Audience": "Designers and server-side web developers (java, python, ruby). It is recommended to have at least one year of experience developing web applications (HTML and CSS). No experience with JavaScript is required.",
  "html5Requirements": "Each student is required to carry his/her own laptop, and should have an administrator account. Windows (XP, Vista, 7) or Linux distributions are preferred, since they are the ones the instructor will be most familiar with. Other software tools will be installed during the labs. During in-house courses an Internet connection for everyone is required.",
  "html5Objectives": "<p>The goals of this course are:</p><ul><li><b>Separate contents and presentation</b></li><li>Introduce the <b>new tags available with HTML5.</b>.</li><li>Introduce the <b>new selectors available with CSS3</b>.</li><li>Introduce the <b>basics of JavaScript and JQuery</b>.</li><li>Apply the <b>new form elements and validation rules of HTML5</b>.</li><li>Understand the <b>browser market share</b>, specially regarding Internet Explorer.</li><li>Learn how to <b>simplify your HTML code</b>.</li><li>Introduce several <b>CSS frameworks</b> (Twitter Bootstrap, Compass).</li><li><b>Improve performance</b> by reducing traffic between browser and server.</li><li><b>Improve accesibility</b>.</li><li>Optimize your <b>search engine results position</b>.</li><li>Keep a consistent appearance including <b>legacy browsers without HTML5 o CSS3 support</b>.</li><li>Learn how to write <b>alternate CSS stylesheets for print</b>.</li><li>Learn how to apply <b>responsive design</b>.</li><li><b>Introduce new fonts</b> other than web-safe.</li><li>Learn <b>new UI patterns</b> for web design.</li></ul>",
  "html5AfterCompleting": "<p>Once this course has been completed, you will be able to:</p><ul><li><b>Create and understand wireframes</b>.</li><li>Develop web applications based on <b>HTML5 y CSS3</b>.</li><li>Replace JavaScript-based animations with faster and more efficient <b>CSS3 transitions</b>.</li><li>Develop a <b>responsive web page</b> suitable for any device.</li><li>Use and create your own <b>sprite images</b>.</li><li>Write <b>efficient CSS selectors</b> that help improve rendering time.</li><li>Use <b>font-face icons</b> to minimize server requests.</li><li><b>Diagnose your web page</b> in any A-class browser.</li><li><b>Introduce new HTML5 tags</b> in existing or new applications without breaking browser compatibility.</li><li><b>Use schema.org</b> in your own projects.</li><li>Use <b>Modernizr and polyfills</b> to include support for legacy browsers.</li><li>Use <b>CSS frameworks</b> and <b>CSS resets</b>.</li><li>Manage your stylesheets using a <b>CSS preprocessor</b> (Sass, LESS, Stylus).</li><li><b>Validate the accesibility and structure</b> of your HTML fles.</li><li><b>Optimize the consumed bandwidth</b> of your web applications.</li><li>Use <b>online development tools</b>.</li><li><b>Get started with SEO</b>.</li><li>Identify <b>browser support</b> for the new standards.</li><li>Test with <b>different versions of Internet Explorer</b> at the same time.</li><li><b>Use LiveReload</b> to edit your web page more efficiently.</li></ul>",
  "html5MultipleRegistrations": "<b>Multiple registrations</b>: 10% for two registrations and 15% for three or more.",





  "hibernateWithSpringObjectives": "<p>At the end of the training, you should gain an understanding of creating Spring applications with Hibernate and be able to:</p><ul><li>Configure Hibernate in the context of a Spring application</li><li>Create efficient object/relational mappings with Hibernate</li><li>Leverage the Spring Framework to facilitate Hibernate session, transaction and exception management</li><li>Use Hibernate with Spring and understand fundamental architectural issues</li><li>Know how and when to use parts of the Spring Framework</li></ul>",
  "hibernateWithSpringRequirements": "Create basic Java web applications; Basic understanding of JDBC and relational database concepts",
  "hibernateWithSpringSyllabus": "<ol><li>Spring Framework Foundations</li><ul><li>Introduction to Spring</li><li>Using Spring to configure an application</li><li>Simplifying application configuration</li><li>Annotation-based dependency injection</li><li>Simplifying JDBC-based data access with Spring</li><li>Driving database transactions in a Spring environment</li></ul><li>Using the Hibernate ORM</li><ul><li>Introducing object-to-relational mapping (ORM)</li><li>Getting started with Hibernate in a Spring environment</li><li>Using JPA annotations and Hibernate XML</li><li>Inheritance: considerations and trade-offs</li><li>Defining custom user-types for Value Objects</li><li>Using queries: HQL, criteria API, native (SQL)</li><li>Hibernate in web applications: open session in view</li><li>Using the different Java collection mappings</li><li>Using joins and components to go beyond naïve class to table mappings</li></ul><li>Hibernate Internals and Configuration</li><ul><li>Working with Hibernate objects</li><li>Lazy loading and detached objects</li><li>Optimistic and pessimistic locking</li><li>Mixing Hibernate and JDBC</li><li>Performance tuning</li><li>Advanced Features: interceptors, schema generation, caching, batching</li></ul></ol>",
  "hibernateWithSpringDuration": "24 hours",
  "hibernateWithSpringLanguage": "This course is available in English and Italian.",
  "hibernateWithSpringAudience": "This training is designed for developers interested in using Hibernate with Spring",



  
  "springCoreObjectives": "<p>At the end of the training, you should have an understanding of Spring and associated technologies and be able to do the following:</p><ul><li>Use the <b>Spring Framework</b> to develop Java applications</li><li>Use <b>dependency injection</b> to set up and configure applications</li><li><b>Test Spring-based applications</b></li><li>Set up Spring configuration using <b>XML, annotations, and Java configuration</b></li><li>Use <b>Hibernate and JDBC with Spring</b> to access relational databases</li><li>Use <b>Spring support for transactions</b></li><li>Use <b>aspect-oriented programming (AOP)</b> to add behavior to objects</li><li>Develop a basic Web application with <b>Spring MVC</b></li><li>Use <b>Spring Security</b> to secure Web applications</li><li>Use Spring with <b>RMI, HttpInvoker, and JMS</b> for remote communication</li><li>Add management with the <b>JMX API</b></li></ul>",
  "springCoreRequirements": "Each student is required to carry his/her own laptop, and should have enough permissions to install applications on it.",
  "springCoreSyllabus": "<ol><li>Introduction to Spring</li><ul><li>The Spring application context</li><li>XML configuration</li><li>Working with existing singletons and factories</li><li>Working with multiple configuration files</li></ul><li>Understanding the Bean Life Cycle</li><ul><li>XML namespaces</li><li>Initialization, use, and destruction phases</li><li>Working with Spring interceptors</li><li>Externalizing constant values into properties files</li><li>Bean scopes</li><li>Simplifying Application Configuration</li><li>Bean definition inheritance</li><li>Inner beans</li><li>p and util namespaces</li><li>Dependency injection of collections</li><li>Spring Expression Language (SpEL)</li></ul><li>Annotation-Based Dependency Injection</li><ul><li>Autowiring and component scanning</li><li>Stereotype annotations</li><li>Java-based configuration</li><li>Mixing configuration styles</li><li>When to use XML, annotations, and Java configuration</li></ul><li>Testing a Spring-Based Application</li><ul><li>Annotations for integration testing with Spring (using JUnit)</li><li>Advanced concepts: application context caching and the @DirtiesContext annotation</li></ul><li>Aspect-Oriented Programming</li><ul><li>What problems does AOP solve?</li><li>Differences between Spring AOP and AspectJ</li><li>Defining pointcut expressions</li><li>How to use the types of advice: around, before, after</li></ul><li>Data Access and JDBC with Spring</li><ul><li>How Spring integrates with existing data access technologies</li><li>DataAccessException hierarchy</li><li>jdbc namespace</li><li>Simplifying jdbc access using the Spring JdbcTemplate</li></ul><li>Integrating Spring with Hibernate</li><ul><li>Quick introduction to ORM with Hibernate</li><li>Benefits of using Spring with Hibernate</li><li>Hibernate configuration in Spring</li><li>Exception handling</li></ul><li>Database Transactions with Spring</li><ul><li>Declaring a Spring Transaction Manager</li><li>@Transactional annotation</li><li>Configuring isolation levels</li><li>Configuring transaction propagation</li><li>Transactions and integration testing</li></ul><li>Spring in a Web Application</li><ul><li>Configuring Spring in a Web application (using Spring MVC, Struts, JSF)</li><li>Introduction to Spring MVC</li><li>Defining Spring MVC controllers using annotations</li><li>Spring MVC in the view layer</li><li>MVC namespace (new in Spring 3.0)</li></ul><li>Spring Security</li><ul><li>What problems does Spring Security solve?</li><li>Configuring authentication</li><li>Intercepting URLs</li><li>The Spring Security tag library for JSPs</li><li>Security at the method level</li><li>Customizing the Spring Security filter chain</li></ul><li>Remoting</li><ul><li>Problems with traditional RMI</li><li>Using Spring remoting over RMI</li><li>Using the Spring HttpInvoker for remote access over HTTP</li></ul><li>JMS</li><ul><li>Introduction to JMS</li><li>Configuring JMS resources with Spring</li><li>Sending and receiving messages using the Spring JmsTemplate and message listener containers</li></ul><li>JMX</li><ul><li>Introduction to JMX</li><li>Configuring Spring to export MBeans automatically</li><li>Exporting a Spring bean as an MBean</li></ul></ol>",
  "springCoreDuration": "32 hours",
  "springCoreLanguage": "This course is available in English, Spanish and Italian.",
  "springCoreAudience": "This training is designed for Java developers and architects.",    
  "springCoreDesc": "<p>Core Spring is the four-day flagship Spring Framework training. In this training, students build a Spring-powered Java application that demonstrates the <b>Spring Framework</b> and other Spring technologies like <b>Spring AOP</b> and <b>Spring Security</b> in an intensely productive, hands-on setting.</p><p>Completion of this training entitles each student to receive a free voucher to schedule an exam at a Pearson VUE Center to become a <b>Spring Certified Professional</b>.</p><p>Core Spring is the perfect training if:</p><ul><li>You are interested in learning all about <b>developing Java applications with Spring</b></li><li>You have an upcoming project and <b>need to learn Spring quickly</b></li><li>You like to become <b>Spring Certified</b> to improve your career opportunities</li></ul><p>To further improve your Spring developer skills we recommend to take <a href=\"#spring-web\">Spring Web</a> or <a href=\"#enterprise-integration-with-spring\">Enterprise Integration with Spring</a> after completing Core Spring.</p>",




  "springWebObjectives": "<p>At the end of the training, you should have an understanding of Spring and associated technologies for web development and be able to do the following:</p><ul><li><b>Develop web applications</b> using the Spring Framework</li><li>Use <b>Spring Web Flow</b> to implement stateful interactions</li><li><b>Secure web applications</b> with Spring Security</li><li><b>Test web applications</b> for correctness and performance</li><li>Create rich web user interfaces with <b>HTML, CSS, and JavaScript</b></li><li>Put it all together with rapid productivity tools like <b>Grails and Spring Roo</b></li><li>Use the <b>SpringSource Tool Suite</b> and <b>Spring Insight</b></li></ul>",
  "springWebRequirements": "Each student is required to carry his/her own laptop, and should have enough permissions to install applications on it.",
  "springWebSyllabus": "<ol><li>Spring Web MVC</li><ul><li>Spring MVC annotation-based programming model</li><li>Page composition with layout technologies such as Tiles</li><li>Rendering multiple content types</li><li>Handling exceptions</li><li>Processing form pages</li><li>Internationalization and personalization</li></ul><li>Spring Web Flow</li><ul><li>Introduction to Spring Web Flow</li><li>Authoring flow definitions</li><li>View states, events and transitions</li><li>Adding flow behavior</li><li>Working with scoped data</li><li>Using the Web Flow integration with JSF</li></ul><li>Spring Security</li><ul><li>Securing a web application with Spring Security</li></ul><li>Integration With Client Technologies</li><ul><li>Modern Web UI</li><li>Progressive enhancement, accessibility, web design</li><li>Working with HTML, CSS and JavaScript</li><li>Using a JavaScript framework (Dojo) for DOM scripting and UI widgets</li><li>Integrating Flex clients with Spring applications</li></ul><li>Rapid Application Development</li><ul><li>Using Grails &amp; Spring Roo</li></ul></ol>",
  "springWebDuration": "32 hours",
  "springWebLanguage": "This course is available in English, Spanish and Italian.",
  "springWebAudience": "This training is designed for developers interested in developing web applications with Spring.", 
  "springWebDesc": "<p>Spring Web is a 4-day training on web application development led by SpringSource experts. This hands-on training teaches you how to apply the latest in Spring to create rich web applications.</p><p>Completion of this training entitles each student to receive a free voucher to schedule an exam at a Pearson Vue Centre to become a <b>SpringSource Certified Spring Web Application Developer</b>. The Spring Web training is also the ideal preparation for the certification exam.</p><p>Spring Web is the perfect training if:</p><ul><li>You like to become an expert at using the <b>Spring Framework</b></li><li>You want to show your developer skills by building beautiful <b>rich web applications</b></li><li><b>You took Core Spring</b> and want to further improve your developer skills</li><li>You are working on/have planned a <b>rich web project</b></li><li>You are interested in being granted the <b>Spring Web certification</b></li></ul><p>To further improve your Spring developer skills we recommend to take <a href=\"#enterprise-integration-with-spring\">Enterprise Integration with Spring</a> after completing Spring Web training.</p>",   



  "eiwsObjectives": "<p>At the end of the training, you should have an understanding of Spring and associated technologies for enterprise integration and be able to do the following:</p><ul><li>Use Spring to <b>create concurrent applications</b> and <b>schedule tasks</b></li><li>Use remoting to implement <b>client-server applications</b></li><li>Use <b>Spring Web services</b> to create loosely coupled SOAP-based Web services and clients</li><li>Use <b>Spring-MVC</b> to create RESTful Web services and clients</li><li>Use <b>JMS</b> for asynchronous messaging-based communication</li><li>Understand and use <b>local and distributed transactions</b></li><li>Use <b>Spring Integration</b> to create event-driven pipes-and-filters architectures and integrate with external applications</li><li>Use <b>Spring Batch</b> for managed, scalable batch processing that is based on both custom and built-in processing components</li></ul>",
  "eiwsRequirements": "Each student is required to carry his/her own laptop, and should have enough permissions to install applications on it.",
  "eiwsSyllabus": "<ol><li>Introduction</li><ul><li>Styles of enterprise integration</li><li>File transfer, remoting, and Web services</li></ul><li>Tasks and Scheduling</li><ul><li>Introduction to concurrency</li><li>Java Concurrency APIs</li><li>Spring task scheduling support</li><li>namespace</li><li>@Scheduled and @Async annotations</li></ul><li>Remoting</li><ul><li>Limitations of “plain” RMI</li><li>Benefits of using Spring remoting</li><li>Spring remoting over RMI</li><li>Spring HttpInvoker</li><li>Hessian and Burlap support</li></ul><li>SOAP Web Services with Spring WS</li><ul><li>Web services best practices</li><li>Introduction to Spring Web services</li><li>Object-XML mapping with the Spring OXM abstraction layer</li><li>Client access with WebServiceTemplate</li><li>Error handling</li><li>Out-of-container testing</li></ul><li>RESTful Web Services</li><ul><li>Core REST concepts</li><li>REST support in Spring 3.x</li><li>REST specific annotations in Spring</li><li>Client access with RestTemplate</li></ul><li>Working with JMS</li><ul><li>Introduction to JMS</li><li>Configuring JMS resources with Spring</li><li>Sending and receiving messages using Spring JmsTemplate and message listener containers</li></ul><li>Transactional JMS</li><ul><li>Why use JMS transactions</li><li>Transactional JMS resources with Spring</li><li>Duplicate message handling</li></ul><li>Global Transaction Management (XA and JTA)</li><ul><li>Two-phase commit and XA</li><li>JTA and Spring</li><li>Configuring JtaTransactionManager</li><li>Transaction demarcation</li></ul><li>Introduction to Spring Integration</li><ul><li>Goals of Spring Integration</li><li>Core components of Spring Integration</li><li>Defining channels, message endpoints, and gateways</li><li>Spring Integration namespaces</li><li>Eclipse-based Visual Editor for Spring Integration</li></ul><li>Configuring Spring Integration</li><ul><li>Channel types and polling</li><li>Synchronous and asynchronous handoff</li><li>Synchronous and asynchronous error handling</li><li>Advanced endpoint types: bridge and router</li><li>Working with MessagingTemplate</li></ul><li>Spring Integration Advanced Features</li><ul><li>Splitting and aggregating messages</li><li>Dispatcher configuration</li><li>XML support: XPath, XSLT, Object-XML mapping</li></ul><li>Introduction to Spring Batch</li><ul><li>Spring Batch high-level overview</li><li>Working with jobs, steps, readers, and writers</li><li>Job parameters and job identity</li><li>Batch state persistence in the database</li><li>Spring Batch quick-start example</li></ul><li>Restart and Recovery with Spring Batch</li><ul><li>Reading flat files</li><li>Introduction to skip, retry, repeat, and restart</li><li>Spring Batch listeners</li></ul><li>Spring Batch Admin and Scaling Batch Jobs</li><ul><li>The Spring Batch Admin Web console</li><li>Scaling and parallel processing</li><li>Multithreaded and parallel steps</li><li>Partitioning</li></ul></ol>",
  "eiwsDuration": "32 hours",
  "eiwsLanguage": "This course is available in English, Spanish and Italian.",
  "eiwsAudience": "This training is designed for Java developers and architects.",
  "eiwsDesc": "<p>Enterprise Integration with Spring is a four-day training course that is led by SpringSource experts who will discuss the most important topics and technologies related to enterprise application integration. This hands-on training teaches you how to apply Spring technologies to solve integration problems that face server-side developers.</p><p>Completion of this training entitles each student to receive a free voucher to schedule an exam at a Pearson VUE Center to become a <b>SpringSource Certified Spring Enterprise Integration Specialist</b>.</p><p>Enterprise Integration with Spring is the perfect training if:</p><ul><li>You like to become an expert at using the <b>Spring Framework</b></li><li><b>You took Core Spring</b> and want to further improve your developer skills</li><li>You like to be able to solve even the <b>most complex problems with Spring</b></li><li>You are working on/have planned a <b>large Spring project</b></li><li>You are interested in being granted the <b>expert Spring certification</b></li></ul><p>To further improve your Spring developer skills we recommend to take <a href=\"#spring-web\">Spring Web</a> after completing Enterprise Integration with Spring.</p>",

  "grailsObjectives": "<p>By the end of the training, you should:</p><ul><li>Have an understanding of the Groovy programming language and the associated Grails framework</li><li>Have a sound knowledge of all the core concepts from the Web to the persistence layer</li><li>Understand key development best practices that enable the development of higher quality code</li></ul>",
  "grailsRequirements": "Experience with developing applications using Java",
  "grailsSyllabus": "<ol><li>The Groovy Language</li><ul><li>Introduction to Groovy</li><li>Installation and Tools</li><li>Groovy Beans</li><li>Language Fundamentals</li><li>Collections and Closures</li><li>Miscellaneous APIs and Java Interoperability</li></ul><li>Advanced Groovy</li><ul><li>Groovy Metaprogramming</li><li>Groovy Annotations and AST</li><li>Building DSLs with Groovy</li><li>Groovy Testing</li></ul><li>Developing Enterprise Applications with Grails</li><ul><li>Introduction to Grails</li><li>Installation and Grails Quick Start</li><li>GORM Basics</li><li>Advanced GORM: Advanced Modeling and Querying</li><li>Testing Grails Components</li></ul><li>Controllers, Views, Services, and Plug-Ins</li><ul><li>Grails Controllers</li><li>GSP, Tag Libraries, and GSP Templates</li><li>Form Handling and AJAX processing</li><li>Grails Services and Transactions</li><li>Grails Plug-Ins</li></ul></ol>",
  "grailsDuration": "32 hours",
  "grailsLanguage": "This course is available in English and Italian.",
  "grailsAudience": "Developers, architects",
  "grailsAfterCompleting": "<p>You should be able to do the following:</p><ul><li>Use Groovy to write programs.</li><li>Integrate with Java.</li><li>Use Groovy to add dynamic functionality.</li><li>Use Grails for Web development and persistence.</li><li>Ensure reliable Grails applications through unit and integration testing.</li><li>Move beyond the basic scaffolding mechanisms to build robust applications.</li></ul>",

  "gcpObjectives": "",
  "gcpRequirements": "This course includes labs to be developed using either Java or Python. It's assumed that the attendee must be fluent in one, but not both.",
  "gcpSyllabus": "",
  "gcpDuration": "40 hours",
  "gcpLanguage": "This course is available in English and Spanish.",
  "gcpAudience": "",
  "gcpDesc": "<p>Extrema Sistemas brings you <b>the Official Google Cloud Platform Qualification Course</b> (CP300).</p><p>CP300 is a comprehensive course that covers five different products of the Google Cloud Platform: <b>App Engine, Compute Engine, Cloud Storage, Cloud SQL</b> and <b>Bigquery</b>. The course includes the possibility to take the official exam to become a <b>Qualified Google Cloud Platform Developer</b>, a recognition extended directly by Google.</p><p>This course is available as a <b>full 5-day course</b> or can be delivered by modules separately. Please consult the available dates for both options. Some courses can be delivered <b>outside of business hours</b> for those members of your team that are absolutely critical.</p><p>With materials developed by Google engineers, this course is delivered by our own <b>Google Developer Experts</b> and <b>Google Authorized Trainers</b>, experts recognized worldwide for their involvement with the developer communities and their expertise with the Google Cloud Platform in particular.</p>",

  "notFoundTitle": "Not so fast, batman!",
  "notFoundShort": "We couldn't find the page you were looking for.",
  "notFoundDesc": "Sorry, this page could not be found. Can you try again from the home page? This time, go slower.",
  "notFoundAlt": "We can still walk you to your destination. Just click the links above.",

  "Contact": "Contact",
  "Spain": "Spain",
  "emailTo": "Email to",
  "Phone": "Phone",
  "seeInGoogleMaps": "See in Google Maps",
  "Italy": "Italy",
  "followUsBlog": "Our blog is full of awesome posts. Are you ready?",
  "followUsTwitter": "Follow us on Twitter for the very last news.",

  "CaseStudies": "Case studies",
  "AenaDesc": "<b>Aena Air Navigation Messaging System</b> During this 1-year project a team with no prior experience with Java was formed to develop a real-time messaging system for air navigation messages that connects 10+ data sources with error recovery mecanisms.",
  "IndraDesc": "<b>Vessel Traffic System</b> A team was created from scratch for this six-month project to develop a system that could control the maritime traffic of a city in Europe, including 20+ different types of navigation alarms (hazards, colisions, restricted areas) and the integration of multiple detection systems in real time (radar, video, goniometer..). The platform integrates a NoSQL data store with a multithreading Java platform, and is actually scaling up to control the entire coast of an European country.",
  "BdeDesc":"<b>Architecture for application development</b> During this one-year project, we modified the architecture for application development of distributed systems to migrate existing systems to a Spring-based platform. This project included a team of six architects, two of them from the bank.",
  "BBVADesc": "<b>E-banking platform</b> Development of the e-banking platform for the private banking branch of BBVA. This project includes the full development of a web front end that enables access to the user assets, including real-time reports of portfolio positions. The final product includes the integration of a complex security platform based on state-of-the-art authentication systems in the back-end.",
  "ONUDesc": "<b>Web technologies training</b> The IT team of the Office of the High Commissioner of Human Rights of the United Nations has received an intensive series of training courses on HTML5 and CSS3 technologies to better support their Intranet and Extranet sites.",
  "moreCaseStudies": "More case studies",

  "cookiePolicyTitle": "This web site uses cookies.",
  "cookiePolicyDesc": "We use first and third-party cookies to improve our service. If you continue, we will assume that you accept our <a href=\"/en/cookies\">cookie policy</a>.",
  "Accept": "Accept",
  "cookiePolicyDescLong": "<p>Every web site uses cookies to improve the user experience. You can block them through your browsers settings, but this will disable some features.</p><ul><li><b>Customization</b> We use cookies to override the preferred language, in case it's not the same as your browser default.</li><li><b>Analytics and research</b> We use cookies to keep track of the kind of features that people love. They help us to build a better user experience.</li></ul>",

  "redirectTitle": "This page has been moved!",
  "redirectDesc": "Sorry for the hassles, but this page has been moved. If the page does not redirect automatically, use the following link",
  "redirectClick": "New page"

}