{
  "from": "from",
  "VATexempt": "VAT exempt.",
  "subsidized": "These courses can be subsidized in Spain up to 100% by <a href='http://www.fundaciontripartita.org/' target='_blank'>Fundación Tripartita</a>. Other countries may have other conditions, please contact us for details.",
  "subsidizedShort": "Subsidized in Spain by <a href='http://www.fundaciontripartita.org/' target='_blank'>Fundación Tripartita</a>",
  "Price": "Price",
  "standardRequirements": "<b>Laptop required:</b> Attendees should bring their own laptops with enough permissions to install additional software.",
  "gcpCertDesc": "After this course the student will be able to take the exam required to become a <b>Google Cloud Platform Qualified Developer</b>.",
  "RegisterFor": "Register for",
  "indexTrainingDesc": "We are working hard to bring you the best IT training courses.",
  "doWeHaveYourAttention": "Got your attention?",
  "attentionDesc": "If this sounds like a project where you could use some help, just drop us a line to start talking.",
  "followUsBlog": "Read our blog",
  "followUsTwitter": "Follow us on Twitter",
  "ContactBody": "We are a small team that answers the phone and replies to every e-mail. Feel free to drop us a line, any time.",
  "Address": "Address",
  "langEnEs": "Available in English and Spanish.",
  "langEnEsIt": "Available in English, Spanish and Italian.",
  "langEnIt": "Available in English and Italian.",
  "duration24h": "24 hours.",
  "duration32h": "32 hours.",
  "duration40h": "40 hours.",

  "Home": "Home",
  "Training": "Training",
  "Contact": "Contact",
  "defaultDesc": "Extrema Sistemas is the lead training company in Spain and Italy, provider of certification courses for Google Cloud Platform and the Spring technology stack.",
  "indexTrainingTitle": "Enjoy the training lead",
  "html5ShortDesc": "Learn about the latest updates on the HTML5 and CSS3 drafts, and optimize your development workflow for modern and legacy browsers.",
  "springDesc": "The official courses about the portfolio of products that have become the <i>de facto</i> standard for the development of Java applications.",
  "pivotalHDShortDesc": "Quickly move your teams to exploit the extended capabilities of Pivotal HD, 'The world’s most powerful Apache Hadoop distribution'.",
  "googleCloudPlatformDesc": "Google Cloud Platform enables developers to build, test and deploy applications on Google’s highly-scalable and reliable infrastructure.",
  "googleTrainingPartner": "<b>Official Course:</b> includes the official exam to become a Google Cloud Platform Qualified Developer, emitted by Google.",
  "springCertifiedPartner": "<b>Official Course:</b> includes the official exam to become a Certified Spring Developer, emitted by VMware.",
  "readMore": "Read more",
  "getInContact": "Get in contact now",
  "consultingTitle": "Get the natural advantage from consulting",
  "consultingDesc": "Join the list of clients that are relying on our consulting and mentoring services.",
  "Courses": "Courses",
  "html5Desc": "<p>This course introduces <b>the latest updates to the HTML5 and CSS3 drafts</b>, including current support in Firefox, Chrome and Internet Explorer.</p><p>During these three days we will review the best practices for web development using the latest standards, including updated techniques and patterns of web design compared with older alternatives. This is a very complete course that covers from wireframing and UI patterns to SEO and performance.</p>",
  "showCourseContents": "View course contents",
  "hideCourseContents": "Hide course contents",
  "availableCourses": "Available courses",
  "askForMoreInfo": "Ask for more info",
  "details": "Details",
  "discountsNotCumulative": "Discounts are not cumulative.",
  "tripartita": "Courses sponsored by Fundación Tripartita.",
  "hibernateWithSpringTitle": "Hibernate with Spring Official Course",
  "hibernateWithSpringDesc": "<p>In this 3-day training you will learn <b>how to create effective data-driven Spring applications with Hibernate</b>. The training shows the use of both XML and annotation based configuration of both Spring and Hibernate.</p><p>Through our courses you benefit from the wide experience and architectural expertise of our team. We bring that experience to you in a highly interactive, intensely hands-on setting.</p>",
  "springCoreTitle": "Spring Core Official Course",
  "springWebTitle": "Spring Web Official Course",
  "pivotalHDDesc": "<p>This comprehensive four day course will provide competent Java developers with the skills necessary to exploit the extended capabilities of Pivotal HD, “The world’s most powerful Apache Hadoop distribution”. The four-day course commences with a grounding in the relevant core technologies:<ul><li>Big fast data, NoSQL and their role in modern business applications</li><li>Introduction to Hadoop HDFS and Map Reduce</li><li>Using Hadoop ecosystem tools such Pig, Hive and HBase</li><li>Overview of the Pivotal HD distribution</li><li>Using Pivotal HAWQ</li></ul></p>",
  "Discounts": "Discounts",
  "springCoreVoucher": "Attendees will receive a voucher for the certification exam to become a <b>SpringSource Certified Spring Professional</b>.",
  "springWebVoucher": "Attendees will receive a voucher for the certification exam to become a <b>SpringSource Certified Spring Web Application Developer</b>",
  "eiwsVoucher": "Completion of this training entitles each student to receive a free voucher to schedule an exam to become a <b>SpringSource Certified Enterprise Integration Specialist</b>.",
  "backToCourses": "Back to courses",
  "Duration": "Duration",
  "Language": "Language",
  "Audience": "Audience",
  "Requirements": "Requirements",
  "Objectives": "Objectives",
  "afterCompleting": "After completing this course",
  "Syllabus": "Syllabus",




  "html5Audience": "Designers and server-side web developers (Java, python, ruby). It is recommended to have at least one year of experience developing web applications (HTML and CSS). No experience with JavaScript is required.",
  "html5Requirements": "During in-house courses an Internet connection for everyone will be required.",
  "html5Objectives": "<p>The goals of this course are:</p><ul><li><b>Separate contents and presentation</b></li><li>Introduce the <b>new tags available with HTML5.</b>.</li><li>Introduce the <b>new selectors available with CSS3</b>.</li><li>Introduce the <b>basics of JavaScript and JQuery</b>.</li><li>Apply the <b>new form elements and validation rules of HTML5</b>.</li><li>Understand the <b>browser market share</b>, specially regarding Internet Explorer.</li><li>Learn how to <b>simplify your HTML code</b>.</li><li>Introduce several <b>CSS frameworks</b> (Bootstrap, Foundation).</li><li><b>Improve performance</b> by reducing traffic between browser and server.</li><li><b>Improve accesibility</b>.</li><li>Optimize your <b>search engine results positioning</b>.</li><li>Keep a consistent appearance including <b>legacy browsers without HTML5 o CSS3 support</b>.</li><li>Learn how to write <b>alternate CSS stylesheets for print</b>.</li><li>Learn how to apply <b>responsive design</b>.</li><li><b>Introduce new fonts</b> other than web-safe.</li><li>Learn <b>new UI patterns</b> for web design.</li></ul>",
  "html5AfterCompleting": "<p>Once this course has been completed, you will be able to:</p><ul><li><b>Create and understand wireframes</b>.</li><li>Develop web applications based on <b>HTML5 y CSS3</b>.</li><li>Replace JavaScript-based animations with faster and more efficient <b>CSS3 transitions</b>.</li><li>Develop a <b>responsive web page</b> suitable for any device.</li><li>Use and create your own <b>sprite images</b>.</li><li>Write <b>efficient CSS selectors</b> that help improve rendering time.</li><li>Use <b>font-face icons</b> to minimize server requests.</li><li><b>Diagnose your web page</b> in any A-class browser.</li><li><b>Introduce new HTML5 tags</b> in existing or new applications without breaking browser compatibility.</li><li><b>Use schema.org</b> in your own projects.</li><li>Use <b>Modernizr and polyfills</b> to include support for legacy browsers.</li><li>Use <b>CSS frameworks</b> and <b>CSS resets</b>.</li><li>Manage your stylesheets using a <b>CSS preprocessor</b> (Sass, LESS, Stylus).</li><li><b>Validate the accesibility and structure</b> of your HTML fles.</li><li><b>Optimize the consumed bandwidth</b> of your web applications.</li><li>Use <b>online development tools</b>.</li><li><b>Get started with SEO</b>.</li><li>Identify <b>browser support</b> for the new standards.</li><li>Test with <b>different versions of Internet Explorer</b> at the same time.</li><li><b>Use Gulp or Grunt tools</b> for a more efficient workflow.</li></ul>",




  "hibernateWithSpringObjectives": "<p>At the end of the training, you should gain an understanding of creating Spring applications with Hibernate and be able to:</p><ul><li>Configure Hibernate in the context of a Spring application</li><li>Create efficient object/relational mappings with Hibernate</li><li>Leverage the Spring Framework to facilitate Hibernate session, transaction and exception management</li><li>Use Hibernate with Spring and understand fundamental architectural issues</li><li>Know how and when to use parts of the Spring Framework</li></ul>",
  "hibernateWithSpringRequirements": "The student should know how to create basic Java web applications and have basic understanding of JDBC and relational database concepts.",
  "hibernateWithSpringSyllabus": "<ol><li>Spring Framework Foundations</li><ul><li>Introduction to Spring</li><li>Using Spring to configure an application</li><li>Simplifying application configuration</li><li>Annotation-based dependency injection</li><li>Simplifying JDBC-based data access with Spring</li><li>Driving database transactions in a Spring environment</li></ul><li>Using the Hibernate ORM</li><ul><li>Introducing Object-to-Relational Mapping (ORM)</li><li>Getting started with Hibernate in a Spring environment</li><li>Using JPA annotations and Hibernate XML</li><li>Inheritance: considerations and trade-offs</li><li>Defining custom user-types for Value Objects</li><li>Using queries: HQL, criteria API, native (SQL)</li><li>Hibernate in web applications: open session in view</li><li>Using the different Java collection mappings</li><li>Using joins and components to go beyond naïve class to table mappings</li></ul><li>Hibernate Internals and Configuration</li><ul><li>Working with Hibernate objects</li><li>Lazy loading and detached objects</li><li>Optimistic and pessimistic locking</li><li>Mixing Hibernate and JDBC</li><li>Performance tuning</li><li>Advanced Features: interceptors, schema generation, caching, batching</li></ul></ol>",
  "hibernateWithSpringAudience": "This course is designed for Java developers interested in using Hibernate with Spring",



  
  "springCoreObjectives": "<p>At the end of the training, you should have an understanding of Spring and associated technologies and be able to do the following:</p><ul><li>Use the <b>Spring Framework</b> to develop Java applications</li><li>Use <b>dependency injection</b> to set up and configure applications</li><li><b>Test Spring-based applications</b></li><li>Set up Spring configuration using <b>XML, annotations, and Java configuration</b></li><li>Use <b>Hibernate and JDBC with Spring</b> to access relational databases</li><li>Use <b>Spring support for transactions</b></li><li>Use <b>aspect-oriented programming (AOP)</b> to add behavior to objects</li><li>Develop a basic Web application with <b>Spring MVC</b></li><li>Use <b>Spring Security</b> to secure Web applications</li><li>Use Spring with <b>RMI, HttpInvoker, and JMS</b> for remote communication</li><li>Add management with the <b>JMX API</b></li></ul>",
  "springCoreRequirements": "This course is perfect for developers with or without prior experience with the Spring framework.",
  "springCoreSyllabus": "<ol><li>Introduction to Spring</li><ul><li>The Spring application context</li><li>XML configuration</li><li>Working with existing singletons and factories</li><li>Working with multiple configuration files</li></ul><li>Understanding the Bean Life Cycle</li><ul><li>XML namespaces</li><li>Initialization, use, and destruction phases</li><li>Working with Spring interceptors</li><li>Externalizing constant values into properties files</li><li>Bean scopes</li><li>Simplifying Application Configuration</li><li>Bean definition inheritance</li><li>Inner beans</li><li>p and util namespaces</li><li>Dependency injection of collections</li><li>Spring Expression Language (SpEL)</li></ul><li>Annotation-Based Dependency Injection</li><ul><li>Autowiring and component scanning</li><li>Stereotype annotations</li><li>Java-based configuration</li><li>Mixing configuration styles</li><li>When to use XML, annotations, and Java configuration</li></ul><li>Testing a Spring-Based Application</li><ul><li>Annotations for integration testing with Spring (using JUnit)</li><li>Advanced concepts: application context caching and the @DirtiesContext annotation</li></ul><li>Aspect-Oriented Programming</li><ul><li>What problems does AOP solve?</li><li>Differences between Spring AOP and AspectJ</li><li>Defining pointcut expressions</li><li>How to use the types of advice: around, before, after</li></ul><li>Data Access and JDBC with Spring</li><ul><li>How Spring integrates with existing data access technologies</li><li>DataAccessException hierarchy</li><li>jdbc namespace</li><li>Simplifying jdbc access using the Spring JdbcTemplate</li></ul><li>Integrating Spring with Hibernate</li><ul><li>Quick introduction to ORM with Hibernate</li><li>Benefits of using Spring with Hibernate</li><li>Hibernate configuration in Spring</li><li>Exception handling</li></ul><li>Database Transactions with Spring</li><ul><li>Declaring a Spring Transaction Manager</li><li>@Transactional annotation</li><li>Configuring isolation levels</li><li>Configuring transaction propagation</li><li>Transactions and integration testing</li></ul><li>Spring in a Web Application</li><ul><li>Configuring Spring in a Web application (using Spring MVC, Struts, JSF)</li><li>Introduction to Spring MVC</li><li>Defining Spring MVC controllers using annotations</li><li>Spring MVC in the view layer</li><li>MVC namespace (new in Spring 3.0)</li></ul><li>Spring Security</li><ul><li>What problems does Spring Security solve?</li><li>Configuring authentication</li><li>Intercepting URLs</li><li>The Spring Security tag library for JSPs</li><li>Security at the method level</li><li>Customizing the Spring Security filter chain</li></ul><li>Remoting</li><ul><li>Problems with traditional RMI</li><li>Using Spring remoting over RMI</li><li>Using the Spring HttpInvoker for remote access over HTTP</li></ul><li>JMS</li><ul><li>Introduction to JMS</li><li>Configuring JMS resources with Spring</li><li>Sending and receiving messages using the Spring JmsTemplate and message listener containers</li></ul><li>JMX</li><ul><li>Introduction to JMX</li><li>Configuring Spring to export MBeans automatically</li><li>Exporting a Spring bean as an MBean</li></ul></ol>",
  "springCoreAudience": "This course is designed for Java developers and architects.",    
  "springCoreDesc": "<p>Core Spring is the four-day flagship Spring Framework training. In this training, students build a Spring-powered Java application that demonstrates the <b>Spring Framework</b> and other Spring technologies like <b>Spring AOP</b> and <b>Spring Security</b> in an intensely productive, hands-on setting.</p><p>Completion of this training entitles each student to receive a free voucher to schedule an exam at a Pearson VUE Center to become a <b>Spring Certified Professional</b>.</p><p>Core Spring is the perfect training if:</p><ul><li>You are interested in learning all about <b>developing Java applications with Spring</b></li><li>You have an upcoming project and <b>need to learn Spring quickly</b></li><li>You want to become <b>Spring Certified</b> to improve your career opportunities</li></ul><p>To further improve your Spring developer skills we recommend to take <a href=\"#spring-web\">Spring Web</a> or <a href=\"#enterprise-integration-with-spring\">Enterprise Spring</a> after completing Core Spring.</p>",




  "springWebObjectives": "<p>At the end of the training, you should have an understanding of Spring and associated technologies for web development and be able to do the following:</p><ul><li><b>Develop web applications</b> using the Spring Framework</li><li>Use <b>Spring Web Flow</b> to implement stateful interactions</li><li><b>Secure web applications</b> with Spring Security</li><li><b>Test web applications</b> for correctness and performance</li><li>Create rich web user interfaces with <b>HTML, CSS, and JavaScript</b></li><li>Put it all together with rapid productivity tools like <b>Grails and Spring Roo</b></li><li>Use the <b>SpringSource Tool Suite</b> and <b>Spring Insight</b></li></ul>",
  "springWebSyllabus": "<ol><li>Spring Web MVC</li><ul><li>Spring MVC annotation-based programming model</li><li>Page composition with layout technologies such as Tiles</li><li>Rendering multiple content types</li><li>Handling exceptions</li><li>Processing form pages</li><li>Internationalization and personalization</li></ul><li>Spring Web Flow</li><ul><li>Introduction to Spring Web Flow</li><li>Authoring flow definitions</li><li>View states, events and transitions</li><li>Adding flow behavior</li><li>Working with scoped data</li><li>Using the Web Flow integration with JSF</li></ul><li>Spring Security</li><ul><li>Securing a web application with Spring Security</li></ul><li>Integration With Client Technologies</li><ul><li>Modern Web UI</li><li>Progressive enhancement, accessibility, web design</li><li>Working with HTML, CSS and JavaScript</li><li>Using a JavaScript framework (Dojo) for DOM scripting and UI widgets</li><li>Integrating Flex clients with Spring applications</li></ul><li>Rapid Application Development</li><ul><li>Using Grails &amp; Spring Roo</li></ul></ol>",
  "springWebAudience": "This course is designed for developers interested in developing web applications with Spring.", 
  "springWebDesc": "<p>Spring Web is a 4-day training on web application development led by SpringSource experts. This hands-on training teaches you how to apply the latest in Spring to create rich web applications.</p><p>Completion of this training entitles each student to receive a free voucher to schedule an exam at a Pearson Vue Centre to become a <b>SpringSource Certified Spring Web Application Developer</b>. The Spring Web training is also the ideal preparation for the certification exam.</p><p>Spring Web is the perfect training if:</p><ul><li>You want to become an expert at using the <b>Spring Framework</b></li><li>You want to show your developer skills by building beautiful <b>rich web applications</b></li><li><b>You took Core Spring</b> and want to further improve your developer skills</li><li>You are working on/have planned a <b>rich web project</b></li><li>You are interested in being granted the <b>Spring Web certification</b></li></ul><p>To further improve your Spring developer skills we recommend to take <a href=\"#enterprise-integration-with-spring\">Enterprise Spring</a> after completing Spring Web training.</p>",   



  "eiwsObjectives": "<p>At the end of the training, you should have an understanding of Spring and associated technologies for enterprise integration and be able to do the following:</p><ul><li>Use Spring to <b>create concurrent applications</b> and <b>schedule tasks</b></li><li>Use remoting to implement <b>client-server applications</b></li><li>Use <b>Spring Web services</b> to create loosely coupled SOAP-based Web services and clients</li><li>Use <b>Spring-MVC</b> to create RESTful Web services and clients</li><li>Use <b>JMS</b> for asynchronous messaging-based communication</li><li>Understand and use <b>local and distributed transactions</b></li><li>Use <b>Spring Integration</b> to create event-driven pipes-and-filters architectures and integrate with external applications</li><li>Use <b>Spring Batch</b> for managed, scalable batch processing that is based on both custom and built-in processing components</li></ul>",
  "eiwsSyllabus": "<ol><li>Introduction</li><ul><li>Styles of enterprise integration</li><li>File transfer, remoting, and Web services</li></ul><li>Tasks and Scheduling</li><ul><li>Introduction to concurrency</li><li>Java Concurrency APIs</li><li>Spring task scheduling support</li><li>namespace</li><li>@Scheduled and @Async annotations</li></ul><li>Remoting</li><ul><li>Limitations of “plain” RMI</li><li>Benefits of using Spring remoting</li><li>Spring remoting over RMI</li><li>Spring HttpInvoker</li><li>Hessian and Burlap support</li></ul><li>SOAP Web Services with Spring WS</li><ul><li>Web services best practices</li><li>Introduction to Spring Web services</li><li>Object-XML mapping with the Spring OXM abstraction layer</li><li>Client access with WebServiceTemplate</li><li>Error handling</li><li>Out-of-container testing</li></ul><li>RESTful Web Services</li><ul><li>Core REST concepts</li><li>REST support in Spring 3.x</li><li>REST specific annotations in Spring</li><li>Client access with RestTemplate</li></ul><li>Working with JMS</li><ul><li>Introduction to JMS</li><li>Configuring JMS resources with Spring</li><li>Sending and receiving messages using Spring JmsTemplate and message listener containers</li></ul><li>Transactional JMS</li><ul><li>Why use JMS transactions</li><li>Transactional JMS resources with Spring</li><li>Duplicate message handling</li></ul><li>Global Transaction Management (XA and JTA)</li><ul><li>Two-phase commit and XA</li><li>JTA and Spring</li><li>Configuring JtaTransactionManager</li><li>Transaction demarcation</li></ul><li>Introduction to Spring Integration</li><ul><li>Goals of Spring Integration</li><li>Core components of Spring Integration</li><li>Defining channels, message endpoints, and gateways</li><li>Spring Integration namespaces</li><li>Eclipse-based Visual Editor for Spring Integration</li></ul><li>Configuring Spring Integration</li><ul><li>Channel types and polling</li><li>Synchronous and asynchronous handoff</li><li>Synchronous and asynchronous error handling</li><li>Advanced endpoint types: bridge and router</li><li>Working with MessagingTemplate</li></ul><li>Spring Integration Advanced Features</li><ul><li>Splitting and aggregating messages</li><li>Dispatcher configuration</li><li>XML support: XPath, XSLT, Object-XML mapping</li></ul><li>Introduction to Spring Batch</li><ul><li>Spring Batch high-level overview</li><li>Working with jobs, steps, readers, and writers</li><li>Job parameters and job identity</li><li>Batch state persistence in the database</li><li>Spring Batch quick-start example</li></ul><li>Restart and Recovery with Spring Batch</li><ul><li>Reading flat files</li><li>Introduction to skip, retry, repeat, and restart</li><li>Spring Batch listeners</li></ul><li>Spring Batch Admin and Scaling Batch Jobs</li><ul><li>The Spring Batch Admin Web console</li><li>Scaling and parallel processing</li><li>Multithreaded and parallel steps</li><li>Partitioning</li></ul></ol>",
  "eiwsAudience": "This course is designed for Java developers and architects.",
  "eiwsDesc": "<p>Enterprise Spring is a four-day training course that is led by SpringSource experts who will discuss the most important topics and technologies related to enterprise application integration. This hands-on training teaches you how to apply Spring technologies to solve integration problems faced by server-side developers.</p><p>Completion of this training entitles each student to receive a free voucher to schedule an exam at a Pearson VUE Center to become a <b>SpringSource Certified Spring Enterprise Integration Specialist</b>.</p><p>Enterprise Spring is the perfect training if:</p><ul><li>You want to become an expert at using the <b>Spring Framework</b></li><li><b>You took Core Spring</b> and want to further improve your developer skills</li><li>You want to be able to solve even the <b>most complex problems with Spring</b></li><li>You are working on/have planned a <b>large Spring project</b></li><li>You are interested in being granted the <b>expert Spring certification</b></li></ul><p>To further improve your Spring developer skills we recommend to take <a href=\"#spring-web\">Spring Web</a> after completing Enterprise Spring.</p>",

  "pivotalHDTitle": "Processing Big Data with Pivotal HD",
  "pivotalHDObjectives": "<p>By the end of the course, you should be able to meet the following objectives:</p><ul><li>Understanding the Hadoop and architecture</li><li>Getting started with MapReduce to nalyze large data sets</li><li>Practical considerations using MapReduce and Designing for MapReduce</li><li>Initial understanding of HDFS concepts</li><li>Advanced and practical considerations with HDFS</li><li>Introduction to streaming MapReduce and Pig</li><li>Overview of Hive</li><li>Understanding the Pivotal HD architecture</li><li>Getting started with HAWQ; Pivotal’s fast SQL driven and HDFS based analysis interface</li><li>Advanced and pragmatic considerations when using HAWQ</li></ul>",
  "pivotalHDRequirements": "The student should be comfort with Java programming and data technologies and have a basic understanding of virtualization concepts.",
  "pivotalHDSyllabus": "<ol><li>Course introduction</li><ul><li>Introductions and course logistics</li><li>Course objectives</li></ul><li>Introduction to Hadoop</li><ul><li>What is Hadoop?</li><li>The Hadoop ecosystem: Pig, Hive, HBase, Zookeeper...</li><li>Understanding MapReduce and HDFS (Hadoop Distributed File System)</li><li>Insuring Data Integrity (checksum...)</li><li>Saving space: input/output compression in Hadoop</li><li>Launching a Hadoop job</li><li>Configuring the Hadoop runtime</li></ul><li>Introduction to Pivotal HD</li><ul></ul><li>Hadoop distributed file system</li><ul><li>Design goals: ability to run on commodity hardware, be fault tolerant...</li><li>Scaling from one datanode to hundreds of datanodes</li><li>HDFS commands</li><li>Working with file paths</li><li>HDFS administration (UI, admin commands...)</li><li>Working with the Java API for HDFS</li><li>Working with a Secordary NameNode, Federated NameNodes and High Availability NameNodes</li></ul><li>Getting started with Map Reduce</li><ul><li>Map Reduce overview</li><li>Hadoop versions</li><li>Writing a mapper</li><li>Writing a reducer</li><li>Debugging and testing</li></ul><li>In-depth Map Reduce</li><ul><li>The Writable hierarchy</li><li>Partitionners, Combiners, Shuffle</li><li>How to reuse objects and Garbage Collector optimization</li><li>Map Reduce restrictions</li><li>Joins (Map side and Reduce side)</li></ul><li>NoSQL overview</li><ul></ul><li>Streaming MapReduce and Pig</li><ul><li>High level alternatives to writing Java Mappers and Reducers</li><li>Hadoop streaming</li><li>Pig scripting</li><li>SQL in Hadoop</li></ul><li>Introduction to Hive</li><ul><li>Hive overview</li><li>Hive tables and DDL</li><li>Partitions and external tables</li><li>Selecting data</li><li>Joins</li><li>Transforms &amp; User Defined Functions (UDFs)</li></ul><li>Getting started with HAWQ</li><ul><li>HAWQ Installation and Environment</li><li>Configuration and Operation Overview</li><li>Client access to HAWQ</li><li>Introduction to HAWQ SQL</li><li>Quick introduction to Spring JDBC and Test Support</li></ul><li>Working with HAWQ</li><ul><li>Creating database tables</li><li>Queries</li><li>Joins</li><li>Functions</li></ul><li>HAWQ external tables</li><ul><li>External Tables overview</li><li>Loading data with gpfdist/gpload</li><li>External tables with PXF</li><li>Loading &amp; unloading data recap</li><li>Hadoop and Sqoop</li></ul><li>HAWQ practical considerations</li><ul><li>Query Plans</li><li>Using ANALYZE and EXPLAIN</li><li>Distributions and partitioning</li><li>Data storage and I/O</li></ul></ol>",
  "pivotalHDAudience": "Administrators, engineers, architects and developers considering or who are currently involved in processing Big Data.",
  "pivotalHDAfterCompleting": "<p>As a result of attending the course, the developer will be able to confidently utilize Pivotal HD, realizing the benefits of this important Hadoop distribution to deliver powerful analysis functionality of massive data with:</p><ul><li>The implementation of Hadoop MapReduce jobs</li><li>The development of real-time data analysis applications with HAWQ</li></ul>",

  "springWhatsNewTitle": "What's new in Spring",
  "springWhatsNewDesc": "<p>In this 3-day training you will learn <b>the important changes after Spring 2.5, including Spring 4</b>. This training will teach XML-based config as well as annotation-based and Java config, including chapters of other courses (Spring Core, Enterprise Spring and Spring Web), so it is the best training if you want to be up-to-date.<p>Want to learn the framework from the beginning? Better try Spring Core, Enterprise Spring or Spring Web instead.",
  "springWhatsNewSyllabus": "<ol><li>Day 1:<ul><li>Introduction to Spring</li><li>Dependency Injection using XML </li><li>Annotations in Spring</li><li>Dependency Injection using Java</li><li>Tasks and Scheduling</li><li>Getting Started with Spring MVC</li></ul></li><li>Day 2:<ul><li>Spring MVC Configuration Options</li><li>Web Application Security with Spring</li><li>Introduction to REST (optional)</li><li>Implementing REST with Spring MVC</li></ul></li><li>Day 3:<ul><li>Debugging and Testing Web Applications</li><li>ORM with Spring and Spring Data</li><li>Introducing Spring's cache abstraction</li><li>Spring 4</li><li>Spring Boot</li></ul></li></ol>",
  "springWhatsNewAudience": "Java developers and architects with experience in Spring 2.5 interested in getting up-to-date with Spring 3 and 4",
  "springWhatsNewObjectives": "<p>At the end of the training, you should have an understanding of Spring and associated technologies and be able to do the following:</p><ul><li>Use the <b>Spring Framework</b> to develop Java applications</li><li>Use <b>dependency injection</b> to set up and configure applications</li><li><b>Test Spring-based applications</b></li><li>Set up Spring configuration using <b>XML, annotations, and Java configuration</b></li><li>Use <b>Spring Data</b> to access relational databases</li><li>Use <b>aspect-oriented programming (AOP)</b> to add caching to services</li><li>Develop a basic Web application with <b>Spring MVC</b></li><li>Use <b>Spring Security</b> to secure Web applications</li><li>Use the new features in <b>Spring 4</b></li><li>Use <b>Spring Boot</b> to develop and deploy your Spring applications</li></ul>",

  "gcpObjectives": "<p>At the end of the training, you should have an understanding of Google Cloud Platform and be able to do the following:</p><ul><li>Store <b>large files on Google Cloud Storage</b> in an effective, reliable and cost-effective way.<li><b>Configure OAuth</b> for the different components of Google Cloud Platform.<li>Use BigQuery to develop <b>your own data mining features</b>.<li><b>Configure networks</b> for your Google Compute Engine applications.<li>Understand more about <b>how Google App Engine works internally</b>.<li>Understand the <b>differences between Google Cloud Datastore and other persistence solutions</b>.<li>Deploy and manage <b>Virtual Machines and Persistent Disks</b> using Google Compute Engine.<li>Deploy a <b>fault-tolerant Cloud SQL database</b> in seconds.<li><b>Predict costs</b> using Google Cloud Platform.</ul>",

  "gcpSyllabus": "<ol><li>Google App Engine<ul><li>Cloud Platform Qualification Training Overview<li>App Engine Architecture & Optimization<li>Managing Your App<li>User APIs and Authentication<li>OAuth<li>Datastore Introduction<li>Datastore Query, Index and Transaction<li>Memcache Basics<li>Task Queue Basics</ul></li><li>Google Cloud Storage<ul><li>Cloud Storage Overview<li>Google Cloud Storage Basics<li>Google Cloud Storage Security<li>Cloud Storage AppEngine Integration and ImageService API<li>Cloud Storage Data Backup & Archive</ul></li><li>Big Query<ul><li>BigQuery Basics<li>BigQuery Developer Topics<li>BigQuery Advanced Topics</li></ul></li><li>Cloud SQL<ul><li>Cloud SQL Basics<li>Cloud SQL Integration</ul></li><li>Google Compute Engine<ul><li>Compute Engine Essentials<li>Developing a GCE Project<li>GCE Administration and Best Practices</ul></li></ol>",

  "gcpRequirements": "This course includes labs to be developed using either Java or Python. It's assumed that the attendee must be fluent in one, but not both.",
  "gcpLanguage": "This course is available in English and Spanish.",
  "gcpAudience": "This course is designed for Java / Python developers or DevOps engineers interested in improving their understanding of Google Cloud Platform.",
  "gcpDesc": "<p>Extrema Sistemas brings you <b>the Official Google Cloud Platform Qualification Course</b> (CP300).</p><p>CP300 is a comprehensive course that covers five different products of Google Cloud Platform: <b>App Engine, Compute Engine, Cloud Storage, Cloud SQL</b> and <b>BigQuery</b>.</p><p>This course is available as a <b>full 5-day course</b> or can be delivered by modules separately. Please consult the available dates for both options. Some courses can be delivered <b>outside of business hours</b> for those team members that are absolutely critical.</p><p>With materials developed by Google engineers, this course is delivered by our own <b>Google Cloud Platform Authorized Trainers</b> and <b>Google Developer Experts</b>, experts recognized worldwide for their involvement with the developer communities and their expertise with Google Cloud Platform.</p><p>After this course the student will be able to take the exam required to become a <b>Google Cloud Platform Qualified Developer</b>, a recognition extended by Google.</p>",

  "notFoundTitle": "Not so fast, batman!",
  "notFoundShort": "We couldn't find the page you were looking for.",
  "notFoundDesc": "Sorry, this page could not be found. Can you try again from the home page? This time, go slower.",
  "notFoundAlt": "We can still walk you to your destination. Just click the links above.",

  "Contact": "Contact",
  "Spain": "Spain",
  "emailTo": "Email to",
  "Phone": "Phone",
  "seeInGoogleMaps": "See in Google Maps",
  "Italy": "Italy",

  "CaseStudies": "Case studies",
  "AenaDesc": "<b>Aena Air Navigation Messaging System</b> During this 1-year project a team with no prior experience was formed to develop a real-time messaging system for air navigation messages that connects 10+ data sources with error recovery.",
  "IndraDesc": "<b>Vessel Traffic System</b> A team was created from scratch for this six-month project to develop a system that could control the maritime traffic of the coast of Poland, including 20+ different types of navigation alarms (hazards, collisions, restricted areas) and the integration of multiple real-time detection systems (radar, video, goniometer..) with a NoSQL back-end.",
  "BdeDesc":"<b>Architecture for application development</b> This one-year project redesigned the architecture to migrate existing systems to a Spring-based platform. This project included a team of six architects, two of them from the bank.",
  "BBVADesc": "<b>E-banking platform</b> Development of the e-banking platform for the private banking branch of BBVA. This project includes the full development of a web front-end that enables access to user assets, including real-time reports of portfolio positions. The final product includes the integration of a complex security platform based on state-of-the-art authentication systems.",
  "ONUDesc": "<b>Web technologies training</b> The Office of the High Commissioner of Human Rights of the United Nations has received an intensive series of training courses on HTML5 and CSS3 technologies to better support their Intranet and Extranet sites.",
  "moreCaseStudies": "More case studies",

  "cookiePolicyTitle": "This web site uses cookies.",
  "cookiePolicyDesc": "We use first and third-party cookies to improve our service. If you continue, we will assume that you accept our <a href=\"/en/cookies\">cookie policy</a>.",
  "Accept": "Accept",
  "cookiePolicyDescLong": "<p>Every web site uses cookies to improve the user experience. You can block them through your browsers settings, but this will disable some features.</p><ul><li><b>Customization:</b> We use cookies to override the preferred language, in case it's not the same as your browser default.</li><li><b>Analytics and research:</b> We use cookies to keep track of the kind of features that people love. They help us to build a better user experience.</li></ul><p>You can block or remove cookies using the options menu in your browser.",

  "redirectTitle": "This page has moved!",
  "redirectDesc": "You are being redirected automatically. If it takes too long, use the link below.",
  "redirectClick": "New page"

}