{
  "gcpPriceNote": "(<span class=nobreak>por el curso completo</span>; <span class=nobreak>cada módulo 995€</span>)<br>",
  "subsidized": "Estos cursos son subvencionables en España hasta un 100% a través de la <a href='http://www.fundaciontripartita.org/' target='_blank'>Fundación Tripartita</a>. Otros países podrían tener otras condiciones, por favor contáctanos para más detalles.",
  "subsidizedShort": "Subvencionable en España por la <a href='http://www.fundaciontripartita.org/' target='_blank'>Fundación Tripartita</a>",
  "Price": "Precio",
  "standardRequirements": "<b>Portátil obligatorio:</b> Los asistentes deberán traer su propio portátil y tener permisos para instalar software adicional.",
  "gcpCertDesc": "Después de este curso el asistente podrá hacer el examen para obtener el título <b>Qualified Google Cloud Platform Developer</b>.",
  "RegisterFor": "Registro para ",
  "indexTrainingDesc": "Estamos trabajando duro para traerte los mejores cursos de training tecnológico.",
  "doWeHaveYourAttention": "¿Tenemos tu atención?",
  "attentionDesc": "Si esto suena como un proyecto en que te vendría bien algo de ayuda, envíanos un correo para empezar a hablar.",
  "followUsBlog": "Lee nuestro blog",
  "followUsTwitter": "Síguenos en Twitter",
  "ContactBody": "Somos un pequeño equipo que contesta al teléfono y responde todos los correos. Siéntete libre de escribirnos, a cualquier hora.",
  "Address": "Dirección",
  "langEnEs": "Disponible en inglés y español.",
  "langEnEsIt": "Disponible en inglés, español e italiano.",
  "langEnIt": "Disponible en inglés e italiano.",
  "duration24h": "24 horas.",
  "duration32h": "32 horas.",
  "duration40h": "40 horas.",

  "googleTrainingPartner": "<b>Curso Oficial:</b> incluye el examen de certificación para obtener el título Qualified Google Cloud Developer emitido por Google.",
  "springCertifiedPartner": "<b>Curso Oficial:</b> incluye el examen de certificación para obtener el título Certified Spring Developer emitido por VMware.",
  "readMore": "Leer más",
  "hibernateWithSpringTitle": "Curso Oficial Hibernate con Spring",
  "html5Requirements": "En cursos in-house, es imprescindible que la sala de impartición del curso disponga de conexión a Internet para todos los asistentes.",
  "springCoreRequirements": "Este curso es perfecto para desarrolladores con o sin experiencia previa con Spring Core.",
  "springWebAudience": "Desarrolladores y arquitectos implicados en proyectos web con Spring.", 
  "eiwsAudience": "Este curso está diseñado para desarrolladores y arquitectos Java.",
  "gcpAudience": "Este curso está diseñado para desarrolladores Java / Python o ingenieros  DevOps interesados en mejorar su conocimiento de Google Cloud Platform.",
  "gcpObjectives": "<p>Al finalizar este curso el asistente entenderá mejor la plataforma Google Cloud y será capaz de:</p><ul><li>Almacenar <b>grandes ficheros en Google Cloud Storage</b> de forma efectiva, fiable y de bajo coste.<li><b>Configurar OAuth</b> para los distintos componentes de Google Cloud Platform.<li>Usar BigQuery para desarrollar <b>funcionalidades de data mining</b>.<li><b>Configurar redes</b> para aplicaciones basadas en Google Compute Engine.<li>Entender más sobre <b>cómo funciona internamente Google App Engine</b>.<li>Entender las <b>diferencias entre Google Cloud Datastore y otras soluciones de persistencia</b>.<li>Desplegar y administrar <b>máquinas virtuales y discos persistentes</b> usando Google Compute Engine.<li>Desplegar una <b>base de datos Cloud SQL tolerante a fallos</b> en segundos.<li><b>Predecir costes</b> usando Google Cloud Platform.</ul>",
  "gcpRequirements": "Este curso incluye laboratorios para realizar usando Java o Python. Se asume que el asistente tendrá experiencia con uno de ellos, pero no ambos.",
  "gcpSyllabus": "<ol><li>Google App Engine<ul><li>Cloud Platform Qualification Training Overview<li>App Engine Architecture & Optimization<li>Managing Your App<li>User APIs and Authentication<li>OAuth<li>Datastore Introduction<li>Datastore Query, Index and Transaction<li>Memcache Basics<li>Task Queue Basics</ul></li><li>Google Cloud Storage<ul><li>Cloud Storage Overview<li>Google Cloud Storage Basics<li>Google Cloud Storage Security<li>Cloud Storage AppEngine Integration and ImageService API<li>Cloud Storage Data Backup & Archive</ul></li><li>Big Query<ul><li>BigQuery Basics<li>BigQuery Developer Topics<li>BigQuery Advanced Topics</li></ul></li><li>Cloud SQL<ul><li>Cloud SQL Basics<li>Cloud SQL Integration</ul></li><li>Google Compute Engine<ul><li>Compute Engine Essentials<li>Developing a GCE Project<li>GCE Administration and Best Practices</ul></li></ol>",
  "gcpDesc": "<p>Extrema Sistemas te trae el <b>curso oficial de Google Cloud Platform</b> (CP300).</p><p>CP300 es un curso muy completo que cubre cinco productos diferentes de Google Cloud Platform: <b>App Engine, Compute Engine, Cloud Storage, Cloud SQL</b> y <b>BigQuery</b>. </p><p>Este curso está disponible como un curso <b>de cinco días</b> o puede ser impartido en módulos separados. Por favor, consulta las fechas disponibles para cada opción. Algunos cursos se pueden impartir <b>fuera del horario laboral</b> para aquellos miembros del equipo que son absolutamente indispensables.</p><p>Con materiales desarrollados por ingenieros de Google, este curso lo imparten nuestros propios <b>Google Developer Experts</b> e <b>Instructores Autorizados de Google</b>, expertos reconocidos internacionalmente por su relación con las comunidades de desarrollo y por su experiencia con Google Cloud Platform.</p><p>Después de este curso el asistente podrá realizar el examen de certificación para obtener el título <b>desarrollador cualificado de Google Cloud Platform</b>, un reconocimiento expedido por Google.",
  "AenaDesc": "<b>Aena Navegación Aérea</b> Durante este proyecto de un año se formó un equipo de 16 personas sin experiencia previa, en un proyecto de desarrollo de un sistema de mensajería aérea en tiempo real que integra más de 10 fuentes diferentes de datos con recuperación de errores.",
  "IndraDesc": "<b>Sistema de control de tráfico marítimo</b> Durante este proyecto de seis meses se formó desde cero un equipo para desarrollar un producto de control de tráfico marítimo con alertas (colisión, zonas de peligro, etc) e integración de sistemas de detección en tiempo real (radares, video, goniómero, etc) y back-end noSQL.",
  "BdeDesc":"<b>Arquitectura para desarrollo de aplicaciones</b> Durante este proyecto de un año se actualizó la arquitectura para aplicaciones en sistemas distribuidos de Banco de España a un sistema basado en arquitectura Spring. El equipo de este proyecto incluyó seis arquitectos, dos de ellos de la entidad.",
  "BBVADesc": "<b>Plataforma de E-banking</b> Desarrollo de plataforma de e-banking para la rama de banca privada de BBVA. Este proyecto incluye el desarrollo completo de un front-end web que da acceso a los productos contratados por el usuario, incluyendo informes en tiempo real de las posiciones de portfolio. El producto final incluye la integración de una compleja plataforma de seguridad basada en sistemas de seguridad de última generación.",

  "Home": "Home",
  "Training": "Training",
  "Contact": "Contacto",
  "defaultDesc": "Extrema Sistemas es la compañía de formación líder en España e Italia, responsable de cursos de certificación para Google Cloud Platform y el conjunto de tecnologías que forman el Spring Portfolio.",
  "indexTrainingTitle": "Habla con el líder en formación",
  "html5ShortDesc": "Aprende las últimas novedades de los drafts de HTML5 y CSS3, y optimiza tu flujo de trabajo para navegadores modernos y legacy.",
  "springDesc": "Los cursos oficiales sobre el estándar <i>de facto</i> para el desarrollo de aplicaciones Java.",
  "groovyAndGrailsDesc": "Aprende desde los conceptos más básicos hasta los aspectos más potentes de Groovy y Grails.",
  "googleCloudPlatformDesc": "Google Cloud Platform permite a los desarrolladores construir, testear y desplegar aplicaciones en la estructura fiable y escalable usada por Google",
  "getInContact": "Ponte en contacto",
  "consultingTitle": "La ventaja natural de la consultoría",
  "consultingDesc": "Súmate a la lista de clientes que han confiado en nuestros servicios de consultoría y mentoring.",
  "Courses": "Cursos",
  "html5Desc": "<p>Este curso introduce las últimas incorporaciones en HTML5 y CSS3, incluyendo el soporte en Firefox, Chrome e Internet Explorer.</p><p>Durante tres días revisaremos las mejores prácticas de desarrollo web actualizadas a los nuevos estándares y se analizarán patrones actualizados de diseño contrastados con soluciones antiguas. Éste es un curso muy completo que cubre desde wireframing y patrones de capa de presentación hasta SEO y rendimiento.</p>",
  "showCourseContents": "Ver contenido del curso",
  "hideCourseContents": "Ocultar contenido del curso",
  "availableCourses": "Cursos disponibles",
  "askForMoreInfo": "Pedir más información",
  "details": "Detalles",
  "VATexempt": "Exento de IVA.",
  "discountsNotCumulative": "Los descuentos no son acumulables.",
  "tripartita": "Cursos bonificables por la Fundación Tripartita.",
  "hibernateWithSpringDesc": "<p>En este curso de 3 días el asistente aprenderá <b>cómo crear aplicaciones efectivas de gestión de información usando Spring y Hibernate</b>. Durante el curso se enseña tanto la configuración usando XML como la configuración basada en anotaciones de Spring y Hibernate.</p><p>Con nuestros cursos te beneficiarás de la amplia experiencia de nuestro equipo. Te traemos esta experiencia en un entorno altamente interactivo y práctico.</p>",
  "springCoreTitle": "Curso Oficial Spring Core",
  "springWebTitle": "Curso Oficial de Spring Web",
  "grailsDesc": "<p>Este curso intensivo de 4 días muestra Groovy y Grails en detalle. Después de una introducción a la tecnología, a los estudiantes se les acompaña a través de <b>los aspectos más avanzados del lenguaje de programación Groovy y del framework de capa web Grails</b>. Este curso cubre desde los aspectos más básicos hasta los más potentes de Groovy y Grails.</p><p>Los estudiantes pueden esperar un curso lleno de laboratorios prácticos e interactivos.</p>",
  "Discounts": "Descuentos",
  "springCoreVoucher": "Los asistentes recibirán un voucher que les permitirá acceder al examen de certificación para obtener el título <b>SpringSource Certified Spring Professional</b>.",
  "springWebVoucher": "Los asistentes recibirán un voucher que les permitirá acceder al examen de certificación para obtener el título <b>SpringSource Certified Spring Web Application Developer</b>.",
  "eiwsVoucher": "Los asistentes recibirán un voucher que les permitirá acceder al examen de certificación para obtener el título <b>SpringSource Certified Enterprise Integration Specialist</b>.",
  "backToCourses": "Volver a cursos",
  "Duration": "Duración",
  "Language": "Idioma",
  "Audience": "Dirigido a",
  "Requirements": "Requisitos",
  "Objectives": "Objetivos",
  "afterCompleting": "Al completar este curso",
  "Syllabus": "Contenido",




  "html5Audience": "Diseñadores, maquetadores de HTML y desarrolladores de código servidor (Java, python, ruby) de capa web. Es recomendable un mínimo de un año desarrollando aplicaciones web (HTML y CSS). No son necesarios conocimientos de JavaScript.",
  "html5Objectives": "<p>Los objetivos del curso son los siguientes:</p><ul><li><b>Separar contenido y presentación</b> de capa web.</li><li>Conocer los <b>nuevos tags introducidos con HTML5</b>.</li><li>Conocer los <b>nuevos selectores y atributos introducidos con CSS3</b>.</li><li>Aprender lo básico de <b>JavaScript y JQuery</b>.</li><li>Aplicar los <b>nuevos componentes de formulario y reglas de validación</b> presentes en HTML5.</li><li>Asumir la <b>cuota de mercado de cada navegador</b>, con tratamiento especial para las versiones de IE.</li><li><b>Simplificar el código HTML</b> generado por el servidor.</li><li>Utilizar <b>frameworks de CSS</b> (Bootstrap, Foundation)</li><li><b>Reducir el tráfico</b> entre navegador y servidor, mejorando el rendimiento.</li><li><b>Mejorar la accesibilidad</b> de las aplicaciones desarrolladas.</li><li>Optimizar el <b>posicionamiento en buscadores</b>.</li><li><b>Mantener una imagen coherente entre navegadores</b>, incluyendo aquellos que no soportan HTML5 o CSS3.</li><li>Aprender a escribir <b>CSS de impresión</b>.</li><li>Aprender a utilizar técnicas de <b>responsive design</b>.</li><li>Aprender a utilizar otras <b>tipografías</b> más allá de las consideradas web-safe.</li><li>Conocer los nuevos <b>patrones de interfaces de usuario</b>.</li></ul>",
  "html5AfterCompleting": "<p>Cuando termine este curso el asistente será capaz de:</p><ul><li><b>Crear e interpretar wireframes</b> eficientemente.</li><li>Desarrollar aplicaciones web basadas en <b>HTML5 y CSS3</b>.</li><li>Sustituir código JavaScript por <b>animaciones basadas en CSS3</b>, más rápidas y eficientes en recursos.</li><li>Diseñar <b>páginas web <i>responsive</i></b> que se adapten a cualquier dispositivo.</li><li><b>Emplear y generar sprites</b> para sus diseños.</li><li>Escribir <b>selectores de CSS más eficientes</b>, mejorando los tiempos de renderizado del navegador.</li><li><b>Emplear iconos mediante font-face</b> reduciendo las peticiones al servidor.</li><li><b>Diagnosticar el render de una página web</b> en cualquier navegador de clase A.</li><li><b>Introducir nuevos tags HTML5</b> en aplicaciones existentes o de nuevo desarrollo, con soporte para navegadores más antiguos.</li><li><b>Utilizar schema.org</b> en sus propios proyectos.</li><li><b>Utilizar Modernizr y polyfills</b> para soportar navegadores sin soporte de HTML5.</li><li>Aplicar <b>frameworks CSS y CSS reset</b>.</li><li>Administrar sus hojas de estilo mediante un <b>pre-procesador de CSS</b> (Sass, LESS, Stylus).</li><li>Validar la <b>accesibilidad del HTML</b>.</li><li><b>Optimizar el ancho de banda</b> consumido por las aplicaciones web.</li><li>Emplear las <b>herramientas de ayuda al desarrollo</b> que hay disponibles online.</li><li><b>Realizar un SEO básico</b> de sus aplicaciones web.</li><li>Identificar el <b>grado de soporte de cada navegador</b>.</li><li>Realizar pruebas a la vez <b>en distintas versiones de IE</b>.</li><li>Usar <b>herramientas basadas en Gulp o Grunt</b> para un flujo de trabajo más eficiente.</li></ul>",





  "hibernateWithSpringObjectives": "<p>Tras finalizar este curso el asistente obtendrá conocimiento sobre cómo crear aplicaciones basadas en Spring y Hibernate y será capaz de:</p><ul><li>Configurar Hibernate en el contexto de una aplicación Spring</li><li>Crear eficientemente mapeos objeto/relational con Hibernate</li><li>Utilizar Spring para facilitar las sesiones, transacciones y el manejo de excepciones con Hibernate</li><li>Utilizar Hibernate con Spring y comprender temas de arquitectura fundamentales</li><li>Saber cómo y cuándo utilizar partes de Spring Framework</li></ul>",
  "hibernateWithSpringRequirements": "El asistente deberá saber cómo crear aplicaciones web con Java y tener un conocimiento básico de JDBC y bases de datos relacionales",
  "hibernateWithSpringSyllabus": "<ol><li>Spring Framework Foundations</li><ul><li>Introducción a Spring</li><li>Usar Spring para configurar una aplicación</li><li>Simplificar la configuración de aplicaciones</li><li>Inyección de dependencias basada en anotaciones</li><li>Simplificar el acceso a datos basado en JDBC con Spring</li><li>Manejar transacciones de bases de datos usando Spring</li></ul><li>Hibernate ORM</li><ul><li>Introducción a Object/Relational Mapping (ORM)</li><li>Empezar con Hibernate en un entorno con Spring</li><li>Utilizar anotaciones JPA y XML de Hibernate</li><li>Herencia: consideraciones y \"trade-offs\"</li><li>Definir tipos propios como Value Objects</li><li>Usar consultas: HQL, criteria API, nativo (SQL)</li><li>Hibernate en aplicaciones web: abrir sesión en la vista</li><li>Utilizar los diferentes mapeos de collecciones Java</li><li>Usar joins y componentes que profundizan en el mapeo de la clase a la tabla</li></ul><li>Hibernate Internals y configuración</li><ul><li>Trabajar con los objetos de Hibernate</li><li>Lazy loading y detached objects</li><li>Bloqueo optimista y pesimista</li><li>Mezclar Hibernate y JDBC</li><li>Performance tuning</li><li>Características avanzadas: interceptores, generación del schema, cacheo, batching</li></ul></ol>",
  "hibernateWithSpringAudience": "Este training esta dirigido a desarrolladores interesados en el uso de Hibernate con Spring.",



  
  "springCoreObjectives": "<p>Tras este curso el asistente tendrá conocimiento sobre Spring y sus tecnologías asociadas y será capaz de:</p><ul><li>Usar <b>Spring Framework</b> para desarrollar aplicaciones Java</li><li>Usar la <b>injección de dependencias</b> para montar y configurar aplicaciones</li><li><b>Testear aplicaciones basadas en Spring</b></li><li>Configurar Spring usando <b>XML, anotaciones y configuración Java</b></li><li>Usar <b>Hibernate y JDBC con Spring</b> para acceder a bases de datos relacionales</li><li>Usar <b>el soporte de Spring para transacciones</b></li><li>Usar <b>programación orientada a aspectos (AOP)</b> para añadir funcionalidades a los objectos</li><li>Desarrollar aplicaciones web básicas usando <b>Spring MVC</b></li><li>Usar <b>Spring Security</b> para asegurar aplicaciones web</li><li>Usar Spring con <b>RMI, HttpInvoker y JMS</b> para conexiones remotas</li><li>Añadir mantenimiento usando el <b>API JMX</b></li></ul>",
  "springCoreSyllabus": "<ol><li>Fundamentos de Spring Framework</li><ul><li>Introducción a la arquitectura de contenedor ligero y el Spring Application Context</li><li>Desarrollo de aplicaciones estructuradas, altamente configurables y testables a través de Dependency Injection y Test-Driven Development.</li><li>Desarrollo de código mejor y más cohesivo, con debate sobre los patrones y mejores prácticas de diseño orientado a objetos.</li><li>Realización de prácticas basadas en modelos de negocios reales.</li></ul><li>Arquitectura eficiente de capa de negocio</li><ul><li>Programación orientada a objetos pragmática en la capa de negocio, con ejemplos y sin tecnicismos</li><li>Persistencia efectiva: cómo construir una capa de persistencia con Spring utilizando las mejores prácticas.</li><li>Análisis y balance de las estrategias relevantes de persistencia, incluyendo Hibernate y Spring JDBC</li><li>Estrategias de gestión de transacciones con Spring en la capa de servicios</li><li>Estrategias de test unitarios y de integración en la capa de negocio</li></ul><li>Implementando conectividad con información Empresarial</li><ul><li>Análisis de conectividad ORM e Hibernate con Spring</li><li>Visión general de Spring Web MVC, Spring JavaScript, Spring Web Flow y Spring Faces</li><li>Configuración de servicios remotos gestionados por Spring</li><li>Diseño de los primeros contratos de servicios web a través de Spring</li></ul><li>Integración con Enterprise Services</li><ul><li>Introducción a Spring Security y el acceso basado en roles</li><li>Gestión a través de Spring JMX</li><li>Configuración de Message-Driven POJOs con Spring JMS</li><li>Análisis de las soluciones empresariales de SpringSource</li></ul></ol>",
  "springCoreAudience": "Este curso está dirigido a desarrolladores y arquitectos Java.",    
  "springCoreDesc": "<p>Core Spring es el curso estrella en formación del framework Spring. Durante este curso los asistentes desarrollan una aplicación Java que pone a prueba las posibilidades de <b>Spring Framework</b> y otras tecnologías como <b>Spring AOP</b> y <b>Spring Security</b> en un entorno productivo e intensamente práctico.<p>Tras este curso el asistente dispondrá de la posibilidad de realizar gratuitamente el examen en un centro de Pearson VUE para consegur el título <b>Spring Certified Professional</b>.<p>Spring Core es el curso perfecto si:</p><ul><li>Se está interesado en aprender todo lo relacionado con el <b>desarrollo de aplicaciones Java con Spring</b></li><li>Se acerca el arranque de un proyecto y <b>se necesita aprender Spring rápidamente</b></li><li>Se desea mejorar el perfil profesional obteniendo la <b>certificación oficial de Spring</b></li></ul><p>Para continuar mejorando el conocimiento de Spring es recomendable asistir a <a href=\"#spring-web\">Spring Web</a> o <a href=\"#enterprise-integration-with-spring\">Enterprise Integration with Spring</a> una vez completado Spring Core.</p>",




  "springWebObjectives": "<p>Al completar este curso, el asistente tendrá conocimiento de Spring y sus tecnologías asociadas para el desarrollo web y será capaz de:</p><ul><li><b>Desarrollar aplicaciones web</b> usando Spring Framework</li><li>Usar <b>Spring Web Flow</b> para implementar interacciones con estado</li><li><b>Asegurar aplicaciones web</b> con Spring Security</li><li><b>Testear aplicaciones web</b> en lógica y rendimiento</li><li>Crear interfaces de usuario ricas usando <b>HTML, CSS y JavaScript</b></li><li>Desarrollar proyectos de forma rápida usando herramientas como <b>Grails y Spring Roo</b></li><li>Usar <b>SpringSource Tool Suite</b> y <b>Spring Insight</b></li></ul>",
  "springWebSyllabus": "<ol><li>Spring MVC</li><ul><li>Modelo de programación basado en anotaciones Spring MVC</li><li>Composición de páginas con tecnologías basadas en Layouts como Tiles</li><li>Visualización de multiples tipos de contenidos</li><li>Gestión de Excepciones</li><li>Procesado de formularios</li></ul><li>Enriqueciendo el interfaz de usuario</li><ul><li>Buenas prácticas para el enriquecimiento del interfaz del usuario.</li><li>Fundamentos de JavaScript para desarrollo Ajax</li><li>Uso del toolkit de Dojo y Spring JS</li><li>Internacionalización y personalización</li></ul><li>Spring Web Flow</li><ul><li>Introducción a Spring WebFlow. Fundamentos del lenguaje de definición de flujos.</li><li>Uso de Actions para invocar lógica de negocio</li><li>Gestión de eventos Ajax, Excepciones y reglas de navegación dinámicas.</li></ul><li>Aplicaciones Robustas y Seguras</li><ul><li>Spring Faces. Integración con JSF</li><li>Construcción de pruebas funcionales</li><li>Protección de aplicaciones web con Spring Security</li><li>Uso de Grails y Roo para el desarrollo rápido de aplicaciones web.</li></ul></ol>",
  "springWebDesc": "<p>El objetivo de este curso es aprender a utilizar la tecnología Spring para crear aplicaciones web completas. El desarrollo de aplicaciones web basadas en Spring desde cero y de forma escalonada junto con una metodología enfocada a resolver los problemas reales más habituales hacen de este curso un complemento ideal para aquéllos que ya tienen cierta experiencia con la tecnología Spring.</p><p>Aunque no es requisito imprescindible, para un mejor aprovechamiento del curso se recomienda haber realizado previamente el curso <a href=\"#spring-core\">Spring Core</a>.</p><p>Este curso es el apropiado si:</p><ul><li>Quiere volverse un experto en el desarrollo con <b>Spring Framework</b></li><li>Quiere mostrar sus conocimientos de desarrollador construyendo <b>aplicaciones web</b></li><li><b>Ha recibido el curso Spring Core</b> y quiere mejorar aún más sus cocnocimientos como desarrollador</li><li>Trabaja (o tiene planeado hacerlo) en un <b>proyecto web</b></li><li>Está interesado en obtener la <b>certificación en Spring Web</b></li></ul><p>Para mejorar aún más sus habilidades en el desarrollo con Spring, le recomendamos el curso <a href=\"#enterprise-integration-with-spring\">Enterprise Integration with Spring</a> tras completar el curso Spring Web.</p>",   



  "eiwsObjectives": "<p>Al completar este curso, el asistente tendrá conocimientos de Spring y sus tecnologías asociadas para la integración empresarial y será capaz de:</p><ul><li>Usar Spring para <b>crear aplicaciones concurrentes</b> y <b>planificar tareas</b>.</li><li>Usar <b>Spring Remoting</b> para implementar aplicaciones clienteservidor.</li><li>Usar <b>Spring Web Services</b> para crear clientes y servicios web basados en SOAP.</li><li>Usar <b>Spring MVC</b> para crear servicios y clientes REST.</li><li>Emplear <b>JMS</b> en sus comunicaciones mediante mensajería asíncrona.</li><li>Entender y utilizar <b>transacciones locales y distribuidas</b>.</li><li>Usar <b>Spring Integration</b> para crear arquitecturas orientadas a eventos e integradas con sistemas externos.</li><li>Usar <b>Spring Batch</b> para la gestión de procesos batch escalables basadas en componentes a medida o incluidos en la plataforma.</li></ul>",
  "eiwsSyllabus": "<ol><li>Introducción</li><ul><li>Tipos de integración de aplicaciones.</li><li>Transferencia de ficheros, remoting y Servicios Web.</li></ul><li>Planificación de Tareas</li><ul><li>Introducción a la concurrencia.</li><li>APIs de concurrencia en Java.</li><li>Soporte para la planificación de tareas en Spring</li></ul><li>Remoting</li><ul><li>Limitaciones de RMI.</li><li>Beneficios de la utilización de Spring Remoting.</li><li>Spring Remoting. RMI, HttpInvoker, Hessian y Burlap.</li></ul><li>Servicios Web SOAP con Spring WS</li><ul><li>Introducción a Spring WS.</li><li>Conversión de objetos a XML con la capa de abstracción OXM</li><li>Acceso a WS desde el cliente con WebService Template</li><li>Gestión de Errores y pruebas integradas.</li></ul><li>Servicios Web REST</li><ul><li>Conceptos principales en REST.</li><li>Soporte REST a partir de Spring 3.0</li><li>Anotaciones REST específicas de Spring.</li><li>Acceso a servicios REST en cliente con RestTemplate.</li></ul><li>Integración de mensajería con JMS</li><ul><li>Configuración de recursos JMS con Spring.</li><li>Simplificación del envío y recepción de mensajes con Spring.</li><li>Transacciones JMS</li><li>Gestión de mensajes duplicados.</li></ul><li>Transacciones globales</li><ul><li>Two-phase commit y XA.</li><li>JTA y Spring.</li><li>Configuración de JTATransactionManager.</li><li>Demarcación transaccional.</li></ul><li>Spring Integration</li><ul><li>Introducción a Spring Integration. Objetivos y componentes principales.</li><li>Definición de canales, endpoints y gateways.</li><li>Tipos de canales y pooling.</li><li>Entrega síncrona y asíncrona.</li><li>Gestión de errores síncrona y asíncrona.</li><li>Tipos especiales de endpoints: Bridge y Router.</li></ul><li>Características avanzadas de Spring Integration</li><ul><li>Separación y unión de mensajes.</li><li>Configuración de Dispatchers.</li></ul><li>Spring Batch</li><ul><li>Introducción a Spring Batch y sus componentes principales.</li><li>Parametros e identificación de tareas.</li><li>Persistencia de estado en BD.</li><li>Lectura de ficheros. ItemReaders/writers</li><li>Spring Batch listeners.</li></ul><li>Spring Batch Admin</li><ul><li>La consola de administración de Spring Batch.</li><li>Paralelizado y escalado del procesamiento de tareas.</li></ul></ol>",
  "eiwsDesc": "<p>Durante este curso de cuatro días se hará un recorrido por los aspectos y tecnologías de mayor relevancia relacionadas con la integración de aplicaciones en un entorno empresarial.</p><p>Se mostrará cómo aplicar Spring para dar solución a los problemas de integración que los desarrolladores se encuentran en el lado servidor. Aunque no es requisito imprescindible, para un mejor aprovechamiento del curso se recomienda haber realizado previamente el curso <a href=\"#spring-core\">Spring Core</a>.</p><p>Una vez finalizado el curso, cada asistente recibirá un voucher que le permitirá planificar y realizar el examen de certificación para obtener el título <b>SpringSource Certified Spring Enterprise Integration Specialist</b>.</p><p>Enterprise Integration con Spring es perfecto si:</p><ul><li>Quiere volverse un experto en el uso de <b>Spring Framework</b></li><li><b>Ha hecho el curso Spring Core</b> y quiere mejorar aún más sus habilidades</li><li>Quiere ser capaz de resolver incluso los <b>problemas más complejos con Spring</b></li><li>Trabaja (o trabajará) en un <b>proyecto de Spring largo</b></li><li>Está interesado en obtener la <b>certificación como experto en Spring</b></li></ul><p>Para mejorar sus conocimientos de Spring, recomendamos el curso <a href=\"#spring-web\">Spring Web</a> tras completar Enterprise Integration con Spring.</p>",

  "grailsObjectives": "<p>Al final del curso:</p><ul><li>Tendrás conocimiento del lenguaje de programación Groovy y el framework Grails</li><li>Conocerás todo lo necesario para el desarrollo de aplicaciones, desde la capa web hasta la de persistencia</li><li>Entenderás las mejores prácticas para el desarrollo de aplicaciones de alta calidad</li></ul>",
  "grailsRequirements": "Experiencia desarrollando aplicaciones Java",
  "grailsSyllabus": "<ol><li>Groovy</li><ul><li>Introducción a Groovy</li><li>Instalación y herramientas</li><li>Groovy Beans</li><li>Fundamentos básicos del lenguaje</li><li>Collections y Closures</li><li>APIs e integración con Java</li></ul><li>Groovy avanzado</li><ul><li>Metaprogramación con Groovy</li><li>Groovy Annotations y AST</li><li>Construyendo DSLs con Groovy</li><li>Testing con Groovy</li></ul><li>Desarrollando aplicaciones empresariales con Grails</li><ul><li>Introducción a Grails</li><li>Grails, instalación y quick start</li><li>GORM</li><li>GORM Avanzado: conceptos avanzados de Modeling y Querying</li><li>Testear componentes de Grails</li></ul><li>Controladores, Vistas, Servicios y Plug-ins</li><ul><li>Controladores Grails</li><li>GSP, Tag Libraries y plantillas GSP</li><li>Gestión de formularios y procesamiento AJAX</li><li>Servicios y transacciones con Grails</li><li>Grails Plug-ins</li></ul></ol>",
  "grailsAudience": "Desarrolladores, arquitectos",
  "grailsAfterCompleting": "<p>Serás capaz de hacer lo siguiente:</p><ul><li>Usar Groovy para desarrollar aplicaciones.</li><li>Integración con Java.</li><li>Usar Groovy para añadir funcionalidad dinámicamente.</li><li>Usar Grails para el desarrollo web y la persistencia.</li><li>Asegurar la calidad de tus aplicaciones Grails a través de tests unitarios y de integración.</li><li>Usar los mecanismos de scaffolding básicos para construir aplicaciones robustas.</li></ul>",


  "Contact": "Contacto",
  "Spain": "España",
  "emailTo": "Email a",
  "Phone": "Teléfono",
  "seeInGoogleMaps": "Ver en Google Maps",
  "Italy": "Italia",

  "CaseStudies": "Casos de éxito",
  "ONUDesc": "<b>Training en Tecnologías Web</b> La Oficina del Alto Comisionado para los Derechos Humanos de las Naciones Unidas en Ginebra ha recibido una sesión intensiva de training en tecnologías HTML5 y CSS3, para dar un mejor soporte a sus páginas Intranet y Extranet.",
  "moreCaseStudies": "Más casos de éxito",

  "cookiePolicyTitle": "Este sitio usa cookies",
  "cookiePolicyDesc": "Usamos cookies propias y de terceros para ofrecerte un mejor servicio. Si sigues navegando asumimos que aceptas nuestra <a href=\"/es/cookies\">política de cookies</a>.",
  "Accept": "Acepto",
  "cookiePolicyDescLong": "<p>Todos los sitios web usan cookies para mejorar la experiencia de usuario. Puedes bloquear las cookies en tu navegador, pero eso desactivará algunas mejoras.</p><ul><li><b>Customización:</b> Usamos cookies para mostrarte la web en tu idioma preferido en caso de que no coincida con el que tienes por defecto en el navegador.</li><li><b>Analítica web y mejoras:</b> Usamos cookies para identificar qué funcionalidades son las preferidas por nuestros usuarios. Esto nos ayuda a crear mejores interfaces.</li></ul><p>Puedes bloquear o eliminar las cookies instaladas en tu equipo en el menú de opciones de tu navegador.",

  "redirectTitle": "Esta página ha cambiado de ubicación",
  "redirectDesc": "Estás siendo redirigido automáticamente. Si esto toma demasiado tiempo, puedes usar el siguiente enlace",
  "redirectClick": "Nueva página"
}