{
  "Home": "Home",
  "Training": "Training",
  "Contact": "Contatti",
  "indexTrainingTitle": "Leader nella formazione",
  "indexTrainingDesc": "Offriamo i migliori corsi IT al miglior prezzo, coprendo una vastissima gamma di tecnologie.",
  "html5ShortDesc": "Le ultime novità sui draft di HTML5 e CSS3, dedicando speciale attenzione ai browser moderni e legacy.",
  "springDesc": "I corsi ufficiali ormai standard di fatto per le applicazioni imprenditoriali basate sulla tecnologia Java.",
  "groovyAndGrailsDesc": "Questo training è progettato per far muovere rapidamente i team al di là delle nozioni di base e gli aspetti più potenti di Groovy e Grails.",
  "googleCloudPlatformDesc": "Google Cloud Platform enables developers to build, test and deploy applications on Google’s highly-scalable and reliable infrastructure.",
  "googleTrainingPartner": "We are Google Training partner!",
  "springCertifiedPartner": "We are Spring Certified partner!",
  "getInContact": "Contattaci",
  "consultingTitle": "Ti offriamo tutti i vantaggi della consulenza",
  "consultingDesc": "Scopri la lista dei clienti che hanno confidato nei nostri servizi di consulenza e mentoring.",
  "Courses": "Courses",
  "html5Desc": "<p>Questo corso dá una visione dello stato attuale delle tecnologie web e degli standard più innovativi, dedicando particolare attenzione al supporto presente in Firefox, Chrome e Internet Explorer.</p><p>I nuovi standard HTML5 e CSS3 sono fattibili giá da anni, permettendo di sviluppare sistemi che sfruttano le ultime versioni dei browser restando allo stesso tempo accessibili a sistemi con Explorer 7 e successivi.</p><p>Durante tre giorni prenderemo in considerazione le migliori pratiche di sviluppo del web secondo i nuovi standard e analizzeremo modelli e tecniche attualizzate di disegno web, in comparazione con le versioni piú antiche. E' un corso molto completo che va dal wireframing e pattern UI ad una breve introduzione a SEO e alle percentuali di mercato dei browser, includendo una dettagliata descrizione del perché IE6 non é piú necessario.</p>",
  "showCourseContents": "Mostra contenuto del corso",
  "hideCourseContents": "Occultare contenuto del corso",
  "availableCourses": "Date disponibili",
  "askForMoreInfo": "Richiedi maggiori informazioni",
  "details": "Dettagli",
  "VATexempt": "Esente IVA.",
  "discountsNotCumulative": "Gli sconti non sono cumulativi.",
  "multipleRegistrations": "<b>Registrazione multipla:</b> 10% di sconto in caso di tre iscrizioni, 15% a partire dal quarto alunno.",
  "extremaAlumni": "I membri di <b>extrema-alumni Italia</b> hanno diritto ad uno sconto esclusivo del 15%.",
  "hibernateWithSpringTitle": "Hibernate con Spring (NUOVO)",
  "hibernateWithSpringDesc": "<p>In questo corso di 3 giorni, imparerete come utilizzare Hibernate e Spring per la realizzazione di applicazioni data-driven. Il training mostrerà come utilizzare la configurazione XML e come utilizzare quella basata sulle annotazioni, sia per Hibernate che per Spring.</p><p>Attraverso questo training, apprenderete come trarre il massimo beneficio dalle esperienze e dalle conoscenze del nostro team di esperti. Vi trasmetteremo la nostra esperienza immergendovi in un contesto altamente interattivo.</p>",
  "springCoreTitle": "Corso Ufficiale Core Spring",
  "springWebTitle": "Spring Web",
  "grailsDesc": "<p>Questa formazione intensiva di quattro giorni presenta Groovy e Grails in dettaglio. Dopo una approfondita introduzione alla tecnologia, gli studenti vengono portati attraverso gli aspetti avanzati del linguaggio di programmazione Groovy e il Grails web application framework. Questo training è progettato per far muovere rapidamente i team al di là delle nozioni di base e gli aspetti più potenti di Groovy e Grails.</p><p>Gli studenti affronteranno un laboratorio intenso, altamente pratico e interattivo.</p>",
  "Discounts": "Sconti",
  "springCoreVoucher": "Gli alunni di ciascuno di questi corsi riceveranno un voucher che permetterà loro di accedere all'esame ufficiale di certificazione \"SpringSource Certified Spring Professional\".",
  "springWebVoucher": "Alla fine del corso ogni alunno può sostenere l'esame e conseguire il certificato \"VMware® SpringSource® Certified Spring Web Application Developer\".",
  "eiwsVoucher": "Alla fine del corso, ogni partecipante riceverá un voucher che gli permetterá di pianificare e realizzare l'esame di certificazione per ottenere il titolo \"SpringSource Certified Spring Enterprise Integration Specialist\".",
  "backToCourses": "Torna ai corsi",
  "Duration": "Durata",
  "Language": "Lingua",
  "Audience": "A chi é rivolto",
  "Requirements": "Requisiti",
  "Objectives": "Obiettivi",
  "afterCompleting": "Al termine del corso",
  "Syllabus": "Contenuto",




  "html5Duration": "24 ore",
  "html5Language": "Il corso é in italiano ma in modalità in-house può essere impartito anche in inglese.",
  "html5Audience": "Designer e sviluppatori web server side (java, python, ruby). E' consigliabile aver maturato un'esperienza minima di un anno nello sviluppo di applicazioni web (HTML e CSS). Non é richiesta alcuna esperienza in Javascript.",
  "html5Requirements": "Ogni alunno deve portare con sé un laptop ed avere un administrator account. Sono preferibili Windows (XP, Vista, 7) o Linux, con i quali l'istruttore ha maggior familiarità. Altri software tool saranno installati durante i laboratori. Nei corsi in modalitá in-house, é necessaria una connessione Internet per tutti.",
  "html5Objectives": "<p>Lo scopo del corso é:</p><ul><li><b>Separare contenuto e presentazione</b></li><li>Introdurre i <b>nuovi tag disponibili nell'HTML5.</b>.</li><li>Introdurre i <b>nuovi selettori disponibili nel CSS3</b>.</li><li>Introdurre le <b>basi di JavaScript e JQuery</b>.</li><li>Applicare i <b>new form elements e le regole di validazione di HTML5</b>.</li><li>Comprendere il <b>market share dei browser</b>, specialmente rispetto ad Internet Explorer.</li><li>Imparare come <b>semplificare il proprio codice HTML</b>.</li><li>Introdurre vari <b>framework CSS</b> (Twitter Bootstrap, Compass).</li><li><b>Migliorare le performance</b> riducendo il traffico tra browser e server.</li><li><b>Migliorare l'accessibilità</b>.</li><li>Ottimizzare il <b>posizionamento nei motori di ricerca</b>.</li><li>Mantenere un'immagine omogenea includendo <b>legacy browser senza il supporto HTML5 o CSS3</b>.</li><li>Imparare a scrivere <b>stylesheet CSS alternativi per la stampa</b>.</li><li>Imparare ad applicare <b>responsive design</b>.</li><li><b>Introdurre nuove fonti</b> oltre a web safe.</li><li>Imparare <b>nuovi pattern UI</b> per web design.</li></ul>",
  "html5AfterCompleting": "<p>Dopo questo corso, l'alunno sarà in grado di:</p><ul><li><b>Creare e comprendere i wireframe</b>.</li><li>Sviluppare applicazioni web basate su <b>HTML5 e CSS3</b>.</li><li>Sostituire le animazioni JavaScript-based con <b>transizioni CSS3</b> più rapide ed efficienti.</li><li>Sviluppare una <b>responsive web page</b> compatibile con ogni dispositivo.</li><li>Creare ed usare le proprie <b>immagini sprite</b>.</li><li>Scrivere <b>selettori CSS efficienti</b> che aiutino a migliorare il rendering time.</li><li>Usare <b>font-face icon</b> per minimizzare le server request.</li><li><b>Diagnosticare la propria pagina web</b> in qualunque browser di classe A.</li><li><b>Introdurre nuovi tag HTML5</b> in applicazioni nuove o già esistenti senza rompere la compatibilità browser.</li><li><b>Usare schema.org</b> nei propri progetti.</li><li>Usare <b>Modernizr e polyfills</b> per il supporto con i browser legacy.</li><li>Usare <b>framework CSS</b> e <b>reset CSS</b>.</li><li>Gestire i propri stylesheet usando un <b>preprocessor CSS</b> (Sass, LESS, Stylus).</li><li><b>Validare l'accessibilità e la struttura</b> del proprio HTML.</li><li><b>Ottimizzare la larghezza della banda consumata</b> dalle proprie applicazioni web.</li><li>Usare <b>tool di sviluppo online</b>.</li><li><b>Dare i primi passi con il SEO</b>.</li><li>Identificare <b>il supporto browser</b> per i nuovi standard.</li><li>Provare <b>versioni differenti di Internet Explorer</b> allo stesso tempo.</li><li><b>Usare LiveReload</b> per editare la propria pagina web in maniera più efficiente.</li></ul>",





  "hibernateWithSpringObjectives": "<p>Al termine del training, sarete in grado di realizzare applicazioni basate su Spring ed Hibernate e sarete abili nel:</p><ul><li>Configurare Hibernate nel contesto di un'applicazione Spring</li><li>Creare, in modo efficiente, applicazioni basaste su ORM con Hibernate</li><li>Fare leva su Spring Framework per facilitare l’utilizzo delle sessioni di Hibernate, le transazioni e la gestione delle eccezioni</li><li>Utilizzare Hibernate con Spring e capirne le problematiche architetturali fondamentali</li><li>Capire come, e quando, utilizzare i componenti di Spring Framework per Hibernate</li></ul>",
  "hibernateWithSpringRequirements": "Saper realizzare applicazioni Java; Conoscenza di base di JDBC e dei concetti legati ai database relazionali",
  "hibernateWithSpringSyllabus": "<ol><li>Fondamenti di Spring Framework</li><ul><li>Introduzione a Spring</li><li>Utilizzare Spring per la configurazione di un'applicazione</li><li>Semplificare la configurazione di un'applicazione</li><li>Dependency Injection basata sulle annotazioni</li><li>Semplificare l’accesso ai dati basato su JDBC con Spring</li><li>Come utilizzare le transazioni in ambiente Spring</li></ul><li>Utilizzo dell'ORM con Hibernate</li><ul><li>Introduzione all’ Object-to-Relational Mapping (ORM)</li><li>Iniziare ad utilizzare Hibernate in ambiente Spring</li><li>Utilizzare le annotazioni JPA ed Hibernate XML</li><li>Ereditarietà: Considerazioni e “trade-offs”</li><li>Utilizzare user-types personalizzati per Value Objects</li><li>Utilizzare le query: HQL, criteria API, SQL (native)</li><li>Hibernate nelle applicazioni web: Open Session in View</li><li>Vari modi di utilizzo del mapping per le Java Collections</li><li>Utilizzare le Join ed i componenti per superare i limiti del mapping tra tabella ed oggetto</li></ul><li>Hibernate Internals e Configurazione</li><ul><li>Lavorare con gli oggetti di Hibernate</li><li>Lazy loading ed oggetti detached</li><li>Locking ottimistico e pessimistico</li><li>Mixing di Hibernate e JDBC</li><li>Tuning delle performance</li><li>Advanced features: Interceptors, generazione dello schema, caching, batching</li></ul></ol>",
  "hibernateWithSpringDuration": "24 ore",
  "hibernateWithSpringLanguage": "Corso disponibile in Italiano e Inglese",
  "hibernateWithSpringAudience": "Tutti gli sviluppatori interessati all’utilizzo di Hibernate con Spring",



  
  "springCoreObjectives": "<p>Alla conclusione del training avrai una buona comprensione di Spring e delle tecnologie associate e sarai in grado di:</p><ul><li>Usare <b>Spring Framework</b> per sviluppare applicazioni Java</li><li>Usare <b>dependency injection</b> per impostare e configurare applicazioni</li><li><b>Test Spring-based applications</b></li><li>Impostare la configurazione di Spring usando <b>XML, annotations e configurazioni Java</b></li><li>Usare <b>Hibernate e JDBC con Spring</b> per accedere ai database relazionali</li><li>Usare <b>Spring support for transactions</b></li><li>Usare <b>aspect-oriented programming (AOP)</b> per aggiungere comportamenti agli oggetti</li><li>Sviluppare un\"applicazione Web di base con <b>Spring MVC</b></li><li>Usare <b>Spring Security</b> per rendere sicure le applicazioni Web</li><li>Usare Spring con <b>RMI, HttpInvoker e JMS</b> per la comunicazione remota</li><li>Aggiungere gestibilità con <b>JMX API</b></li></ul>",
  "springCoreRequirements": "Ogni alunno deve portare con sé un laptop ed avere un administrator account. Sono preferibili Windows (XP, Vista, 7) o Linux, con i quali l'istruttore ha maggior familiarità. Altri software tool saranno installati durante i laboratori. Nei corsi in modalitá in-house, é necessaria una connessione Internet per tutti.",
  "springCoreSyllabus": "<ol><li>Fondamenti di Spring Framework</li><ul><li>Introduzione all’ architettura di tipo lightweight, IoC Container ed Application Context.</li><li>Sviluppo di applicazioni strutturate, configurabili e testabili attraverso Dependency Injection e Test-Driven Development.</li><li>Sviluppo di codice migliore e maggiormente coeso, con utilizzo di Design Patterns ed Object Oriented.</li><li>Realizzazione di esercizi basati su modelli di business reali.</li></ul><li>Business Layer</li><ul><li>Aggiungere comportamenti agli oggetti con l’ AOP (Aspect Oriented Programming).</li><li>Introduzione alla Persistenza: come costruire il Persistence Layer con Spring.</li><li>Persistenza con Spring JDBC.</li><li>Strategie di gestione delle transazioni con Spring nel Service Layer.</li><li>Strategie di test d’unità e di integrazione a livello di Business Layer.</li></ul><li>Enterprise Information Connectivity</li><ul><li>Introduzione all’ ORM (Object-to-Relational Mapping).</li><li>Utilizzo e configurazione di Hibernate con Spring.</li><li>Architettura di una Web Application con Spring.</li><li>Introduzione a Spring Web MVC, Spring JavaScript, Spring Web Flow e Spring Faces.</li><li>Spring MVC.</li><li>RESTful Web Services con Spring MVC.</li></ul><li>Integrazione con servizi Enterprise</li><ul><li>Rendere sicure le applicazioni con Spring Security.</li><li>Introduzione a Spring Remoting.</li><li>Come semplificare applicazioni JMS tramite Message-Driven POJOs con Spring JMS.</li><li>Gestione delle applicazioni con JMX tramite Spring.</li></ul></ol>",
  "springCoreDuration": "32 ore",
  "springCoreLanguage": "Il corso é in italiano ma in modalità in-house può essere impartito anche in inglese.",
  "springCoreAudience": "E’ quindi importante sottolineare che gli alunni devono possedere previa conoscenza delle API Java, dei concetti JEE, JTA e delle API Servlet.",    
  "springCoreDesc": "<p>Core Spring è il corso di formazione principale, di quattro giorni, di Spring Framework. In questo corso gli studenti impareranno come costruire, in modo pratico e produttivo, un\"applicazione Java Spring-powered che mostra le potenzialità di <b>Spring Framework</b> e delle altre tecnologie come <b>Spring AOP</b> e <b>Spring Security</b>.</p><p>Il completamento di questa formazione dà diritto ad ogni studente di ricevere un voucher gratuito per pianificare un esame in un Pearson VUE Center per diventare uno <b>Spring Core Professional</b>.</p><p>Core Spring è il training ideale se:</p><ul><li>Ti interessa sapere tutto sullo <b>sviluppo di applicazioni Java con Spring</b></li><li>Hai un progetto imminente e <b>hai bisogno di imparare Spring rapidamente</b></li><li>Ti piacerebbe diventare <b>Spring Certified</b> e migliorare le tue opportunità professionali</li></ul><p>Per migliorare ulteriormente le tue capacità come sviluppatore Spring ti suggeriamo di seguire il corso <a href=\"#spring-web\">Spring Web</a> o <a href=\"#enterprise-integration-with-spring\">Enterprise Integration with Spring</a> dopo aver completato il corso Core Spring.</p>",




  "springWebObjectives": "<p>Al termine del training avrai una buona comprensione di Spring e delle tecnologie associate per lo sviluppo web e sarai capace di:</p><ul><li><b>sviluppare applicazioni web</b> usando Spring Framework</li><li>Usare <b>Spring Web Flow</b>per implementare interazioni di tipo stateful</li><li><b>Rendere sicure le applicazioni web</b> con Spring Security</li><li><b>Testare le applicazioni web</b> per correttezza e performance</li><li>Creare interfacce utente di tipo rich web con <b>HTML, CSS e JavaScript</b></li><li>Mettere tutto insieme con rapidi strumenti di produttività come <b>Grails e Spring Roo</b></li><li>Usare <b>SpringSource Tool Suite</b> e <b>Spring Insight</b></li></ul>",
  "springWebRequirements": "Ogni alunno deve portare con sé un laptop ed avere un administrator account. Sono preferibili Windows (XP, Vista, 7) o Linux, con i quali l'istruttore ha maggior familiarità. Altri software tool saranno installati durante i laboratori. Nei corsi in modalitá in-house, é necessaria una connessione Internet per tutti.",
  "springWebSyllabus": "<ol><li>Applicando MVC</li><ul><li>Visione generale del corso e delle applicazioni corrispondenti. Aspetti base di Spring MVC.</li><li>Integrazione di varie tecnologie e formati per l’esposizione dei contenuti, includen do JSP/JSTL, Tiles, PDF ed Excel.</li><li>Data-Entry Form, Binding e Validazione.</li></ul><li>Implementazione di Interfacce di tipo Rich</li><ul><li>Analisi delle migliori tecniche per il disegno di interfacce utente in relazione al con tenuto, lo stile ed il comportamento delle stesse.</li><li>Aspetti fondamentali di Javascript per sviluppatori Ajax.</li><li>Massimizzazione delle funzionalitá del Dojo Toolkit.</li><li>Internazionalizzazione, personalizzazione ed accessibilità di Applicazioni Web sviluppate con Spring.</li></ul><li>Utilizzo di Spring Web Flow</li><ul><li>Primi passi con Spring Web Flow.</li><li>Aspetti essenziali del linguaggio utilizzato nella definizione dei Flow (Flow Definition Language). Stati, Eventi e Transizioni. Aggiungere comportamenti ad un Flow.</li><li>Controllo di eventi Ajax, gestione dinamica delle eccezioni e delle regole di navigazione.</li></ul><li>Sviluppo di applicazioni web affidabili e sicure</li><ul><li>Integrazione di componenti JSF con Spring Faces.</li><li>Test di accettazione e di carico durante l’intero ciclo di sviluppo di un Applicazione Web.</li><li>Hibernate in contesti di operatività su grandi volumi ed alta concorrenza.</li><li>Integrazione di vari sistemi di applicazioni, includendo servizi gestiti da Spring, OSGi e Servizi Web.</li></ul></ol>",
  "springWebDuration": "32 ore",
  "springWebLanguage": "Il corso é in italiano ma in modalità in-house può essere impartito anche in inglese.",
  "springWebAudience": "E’ quindi importante sottolineare che gli alunni devono possedere previa conoscenza della tecnologia Spring.", 
  "springWebDesc": "<p>Spring Web è un corso di formazione di 4 giorni per lo sviluppo di applicazioni web. In questo corso gli studenti impareranno come applicare, in modo pratico, le ultime novità in Spring per creare applicazioni web.</p><p>Il completamento di questa formazione dà diritto ad ogni studente di ricevere un voucher gratuito per pianificare un esame in un Pearson VUE Center per diventare un <b>Vmware® SpringSource® Certified Spring Web Application Developer</b>.</p><p>Spring Web é il training ideale se:</p><ul><li>Vuoi diventare un esperto nell&amp;qout;utilizzo di <b>Spring Framework</b></li><li>Vuoi mostrare le tue capacità di sviluppatore costruendo ottime <b>web application</b></li><li><b>Hai già seguito il corso Core Spring</b> e vuoi migliorare ulteriormente le tue capacità di sviluppatore</li><li>Stai lavorando su/stai pianificando un <b>progetto web</b></li><li>Sei interessato a ricevere la <b>certificazione Spring Web</b></li></ul><p>Per migliorare ulteriormente le tue capacità di sviluppatore Spring ti suggeriamo di realizzare <a href=\"#enterprise-integration-with-spring\">Enterprise Integration with Spring</a> dopo aver completato Spring Web.</p>",   



  "eiwsObjectives": "<p>Alla conclusione del training avrai una buona comprensione di Spring e delle tecnologie associate per l\"enterprise integration e sarai capace di:</p><ul><li>Usare Spring per la creazione di applicazioni concorrenti e la pianificazione dei Task.</li><li>Usare Remoting per implementare applicazioni client-server.</li><li>Usare Spring Web Services per la creazione, nel rispetto del principio di Loose Coupling, di Servizi Web e Client basati su SOAP.</li><li>Usare Spring MVC per la creazione di Servizi Web e Client RESTful.</li><li>Usare JMS per la gestione asincrona di comunicazioni Messaging-based.</li><li>Capire e usare transazioni locali e distribuite.</li><li>Usare Spring Integration per la creazione di architetture Event-driven e Pipes-and-Filters e come integrarle con sistemi ed applicazioni esterne.</li><li>Usare Spring Batch per la gestione e la scalabilità d’esecuzione di procedure batch basate su componenti standard o create su misura.</li></ul>",
  "eiwsRequirements": "Ogni alunno deve portare con sé un laptop ed avere un administrator account. Sono preferibili Windows (XP, Vista, 7) o Linux, con i quali l'istruttore ha maggior familiarità. Altri software tool saranno installati durante i laboratori. Nei corsi in modalitá in-house, é necessaria una connessione Internet per tutti.",
  "eiwsSyllabus": "<ol><li>Introduzione</li><ul><li>Tipi di integrazione in ambito Enterprise.</li><li>Trasferimento di Fil, Remoting e Servizi Web.</li></ul><li>Pianificazione dei Task</li><ul><li>Introduzione alla concorrenza.</li><li>API per la concorrenza in Java.</li><li>Supporto per la pianificazione dei Task in Spring.</li><li>Il namespace<task>.</task></li><li>Le annotazioni @Scheduled ed @Asynch.</li></ul><li>Remoting</li><ul><li>Limitazioni nell’utilizzo classico di RMI.</li><li>I benefici dell’utilizzo di Spring Remoting.</li><li>Spring Remoting su RMI. HttpInvoker. Il supporto, in Spring, per Hessian e Burlap.</li></ul><li>Servizi Web SOAP con Spring WS</li><ul><li>Come utilizzare, in modo pratico e migliore, i Servizi Web.</li><li>Introduzione a Spring WS.</li><li>Mappatura di oggetti da e verso XML con il Layer d’ Astrazione Spring OXM.</li><li>Accesso Client ai Servizi Web con il WebServiceTemplate.</li><li>Gestione degli errori.</li><li>Out-of-container Testing, come testare i Servizi Web in isolamento.</li></ul><li>Servizi Web REST</li><ul><li>Concetti principali in REST.</li><li>Il Supporto REST in Spring 3.x.</li><li>Annotazioni specifiche REST in Spring.</li><li>Accesso Client ai Servizi REST con il RestTemplate.</li></ul><li>Utilizzare JMS</li><ul><li>Introduzione a JMS.</li><li>Configurazione delle risorse JMS in Spring.</li><li>Come inviare e ricevere messaggi utilizzando il JmsTemplate ed i Message Listener</li><li>Containers in Spring.</li></ul><li>JMS Transazionale</li><ul><li>Perché utilizzare le transazioni JMS.</li><li>Le risorse transazionali JMS con Spring.</li><li>La gestione della duplicazione dei messaggi.</li></ul><li>Transazioni Globali</li><ul><li>Le Two-phase commit ed XA.</li><li>JTA e Spring.</li><li>Come configurare il JTATransactionManager.</li><li>La demarcazione delle transazioni.</li></ul><li>Introduzione a Spring Integration</li><ul><li>Gli obiettivi di Spring Integration.</li><li>I componenti principali di Spring Integration.</li><li>Definizione di Canali, Message Endpoints e Gateways.</li><li>Spring Integration namespaces.</li><li>Spring Integration ed il Visual Editor basato su Eclipse.</li></ul><li>Configurazione di Spring Integration</li><ul><li>Tipi di Canali e Polling.</li><li>“Handoff” sincrono ed asincrono.</li><li>Gestione degli errori sincrona ed asincrona.</li><li>Tipi speciali di endpoints: Bridge e Router.</li><li>Utilizzare il MessagingTemplate</li></ul><li>Caratteristiche avanzate di Spring Integration</li><ul><li>Separazione ed aggregazione dei messaggi.</li><li>Configurazione del Dispatcher.</li><li>Supporto XML: XPath, XSLT, Object-XML mapping</li></ul><li>Introduzione a Spring Batch</li><ul><li>Spring Batch: Panoramica ad alto livello.</li><li>Come utilizzare Jobs, Steps, Readers e Writers.</li><li>Job: Parametri ed identità.</li><li>Persistenza di stato dei Batch nel Database.</li><li>Spring Batch: Esempio di Quick-start.</li></ul><li>Riavvio e Recovery con Spring Batch</li><ul><li>Stateful ItemReaders/Writers.</li><li>Lettura di File</li><li>Introduzione ai meccanismi di skip, retry, repeat e restart.</li></ul><li>Spring Batch Admin</li><ul><li>Amministrare Spring Batch dalla Spring Batch Admin Web Console.</li><li>Jobs: Esecuzione parallela e scalabilità.</li><li>Steps: Esecuzione parallela e Multi-thread.</li><li>Partizionamento.</li></ul></ol>",
  "eiwsDuration": "32 ore",
  "eiwsLanguage": "Il corso é in italiano ma in modalità in-house può essere impartito anche in inglese.",
  "eiwsAudience": "Esperienza nello sviluppo di applicazioni Java, conoscenza base di Spring e del Container IOC (Inversione di Controllo). Nonostante non sia imprescindibile, é raccomandabile aver realizzato previamente il corso di Core Spring.",
  "eiwsDesc": "<p>Enterprise Integration with Spring è un corso di formazione di quattro giorni guidato da esperti SpringSource che discuteranno i temi più importanti e le tecnologie legate all&amp;qout;Enterprise Application Integration. Questa pratica formazione vi insegna come applicare le tecnologie Spring per risolvere i problemi di integrazione che devono affrontare gli sviluppatori lato server.</p><p>Il completamento di questa formazione dà diritto ad ogni studente di ricevere un voucher gratuito per pianificare un esame in un Pearson VUE Center per diventare uno <b>SpringSource Certified Spring Enterprise Integration Specialist</b>.</p><p>Enterprise Integration with Spring è il corso ideale se:</p><ul><li>Vuoi diventare un esperto nell\"utilizzo di <b>Spring Framework</b></li><li><b>Hai già realizzato il corso Core Spring</b> e vuoi migliorare ulteriormente le tue capacità di sviluppatore</li><li>Vuoi essere in grado di risolvere anche i <b>problemi più difficili con Spring</b></li><li>Stai lavorando su/stai pianificando un <b>lungo progetto Spring</b></li><li>Ti interessa ottenere la<b>certificazione Spring expert</b></li></ul><p>Per migliorare ulteriormente le tue capacità di sviluppatore Spring ti raccomandiamo di realizzare <a href=\"#spring-web\">Spring Web</a> dopo aver completato Enterprise Integration with Spring.</p>",

  "grailsObjectives": "<p>Al termine di questo training sarete in grado di:</p><ul><li>Comprendere il linguaggio di programmazione Groovy ed il framework Grails ad esso associato</li><li>Avere conoscenza di tutti i concetti del core, dal web al persistence layer</li><li>Capire quali sono, nello sviluppo, i punti chiave e le best practices da applicare per la realizzazione di applicazioni di alta qualità</li></ul>",
  "grailsRequirements": "Esperienza nello sviluppo di applicazioni Java",
  "grailsSyllabus": "<ol><li>Il linguaggio Groovy</li><ul><li>Introduzione a Groovy</li><li>Tools ed installazione</li><li>Groovy Beans</li><li>I fondamentali del linguaggio</li><li>Closures e Collections</li><li>Miscellanea per API ed interoperabilità Java</li></ul><li>Advanced Groovy</li><ul><li>Groovy Metaprogramming</li><li>Annotazioni Groovy e AST</li><li>Creare Domain Specific Languages con Groovy</li><li>Testing con Groovy</li></ul><li>Sviluppo di applicazioni enterprise con Grails</li><ul><li>Introduzione a Grails</li><li>Grails, installazione e quick start</li><li>GORM basics</li><li>Advanced GORM: concetti avanzati per Modeling e Querying</li><li>Testing dei componenti con Grails</li></ul><li>Controllers, Views, Services e Plug-ins</li><ul><li>Grails Controllers</li><li>GSP, Tag Libraries e GSP Templates</li><li>Gestione delle Form e AJAX processing</li><li>Grails Services e le transazioni</li><li>Grails Plug-Ins</li></ul></ol>",
  "grailsDuration": "32 ore",
  "grailsLanguage": "Corso disponibile in Italiano ed Inglese.",
  "grailsAudience": "Sviluppatori, architetti",
  "grailsAfterCompleting": "<p>Sarete in grado di applicare:</p><ul><li>Groovy per scrivere i programmi</li><li>L’integrazione con Java</li><li>Uso di Groovy per aggiungere funzionalità dinamiche</li><li>Uso di Grails per lo sviluppo del web e del persistence layer</li><li>Assicurare l’affidabilità delle applicazioni Grails tramite i test di unità ed integrazione</li><li>Andare al di là dei meccanismi basici di scaffolding per la creazione di applicazioni solide e robuste</li></ul>",

  "gcpObjectives": "",
  "gcpRequirements": "This course includes labs to be developed using either Java or Python. It's assumed that the attendee must be fluent in one, but not both.",
  "gcpSyllabus": "",
  "gcpDuration": "40 ore",
  "gcpLanguage": "This course is available in English and Spanish.",
  "gcpAudience": "",
  "gcpDesc": "<p>Extrema Sistemas brings you <b>the Official Google Cloud Platform Qualification Course</b> (CP300).</p><p>CP300 is a comprehensive course that covers five different products of the Google Cloud Platform: <b>App Engine, Compute Engine, Cloud Storage, Cloud SQL</b> and <b>Bigquery</b>. The course includes the possibility to take the official exam to become a <b>Qualified Google Cloud Platform Developer</b>, a recognition extended directly by Google.</p><p>This course is available as a <b>full 5-day course</b> or can be delivered by modules separately. Please consult the available dates for both options. Some courses can be delivered <b>outside of business hours</b> for those members of your team that are absolutely critical.</p><p>With materials developed by Google engineers, this course is delivered by our own <b>Google Developer Experts</b> and <b>Google Authorized Trainers</b>, experts recognized worldwide for their involvement with the developer communities and their expertise with the Google Cloud Platform in particular.</p>",

  "Contact": "Contatti",
  "Spain": "Spagna",
  "emailTo": "Scrivi a",
  "Phone": "Telefono",
  "seeInGoogleMaps": "Visualizzare su Google Maps",
  "Italy": "Italia",
  "joinTeamTitle": "Vuoi essere il nostro prossimo sviluppatore?",
  "joinTeamDesc": "Per unirti al nostro gruppo, invia il tuo CV a",
  "sendCV": "Invia il tuo CV",

  "CaseStudies": "Case studies",
  "AenaDesc": "<b>Aena navigazione aerea</b> Durante questo progetto di un anno si creò un team di sedici persone senza alcuna precedente esperienza in Java. Il progetto fu dedicato allo sviluppo di un sistema di messaggistica aerea che gestisse, in tempo reale e con recupero degli errori, messaggi da piú di dieci fonti differenti di dati.",
  "IndraDesc": "<b>Sistema di controllo del traffico marittimo</b> Durante questo progetto di sei mesi si formó da zero un team senza alcuna precedente esperienza in Java. Il progetto consisteva nello sviluppo di un prodotto per il controllo del traffico marittimo con allarmi di collisione ed integrazione di sistemi di detezione in tempo reale (radar, video, goniometro, etc). La piattaforma integra archivi noSQL con piattaforma multithreading basata su Java e attualmente sta scalando per controllare l'intero traffico marittimo di un Paese europeo.",
  "BdeDesc":"<b>Architettura per sviluppo di applicazioni</b> Durante questo progetto della durata di sei mesi, abbiamo aggiornato l'architettura per applicazioni in sistemi distribuiti di Banco de España ad un sistema basato su Spring. Questo progetto ha coinvolto un team di sei architetti, due della banca e quattro esterni.",
  "BBVADesc": "<b>Piattaforma di E-banking</b> Sviluppo della piattaforma di e-banking per il settore private bank di BBVA. Questo progetto comprende lo sviluppo completo di un front-end web che dá accesso ai prodotti acquistati dall'utente, includendo rapporti sulle posizioni del portfolio in tempo reale. Il prodotto finale comprende l'integrazione di una piattaforma di sicurezza completa basata su sistemi di autenticazione di ultima generazione nel back-end della banca.",
  "ONUDesc": "<b>Training in Tecnologie Web</b> Il team IT dell'Ufficio dell'Alto Commissariato delle Nazioni Unite per i Diritti Umani, a Ginevra, ha ricevuto una serie di corsi sulla tecnologia HTML5 e CSS3, al fine di dare un miglior supporto alle loro pagine web Intranet ed Extranet.",
  "moreCaseStudies": "Più casi di successo",

  "cookiePolicyTitle": "Questo sito usa cookie",
  "cookiePolicyDesc": "Usiamo cookie propri e di terzi per offrirti un servizio migliore. Se continui a navigare, intendiamo che accetti la nostra <a href=\"/it/cookies\">politica di cookie</a>.",
  "Accept": "Accetto",
  "cookiePolicyDescLong": "<p>Tutti i siti internet usano cookie per migliorare l'esperienza dell'utente. Puoi bloccare i cookie nel tuo browser, però questo disattiverá alcuni vantaggi</p><ul><li><b>Personalizzazione</b>. Usiamo cookie per mostrarti la pagina nella tua lingua preferita quando questa non coincide con la lingua predefinita nel tuo web browser.</li><li><b>Analisi web e vantaggi</b>. Usiamo cookie per identificare le funzioni prefeite dei nostri utenti. Ciò ci aiuta a creare interfacce migliori.</li></ul>"
}